s-iwaki-d/ESP32Drop/ESP32Drop/src/airdrop/port/ad_port_esp32.cpp
/* ⚠️ THE RECEIVING HALF, AND IT IS ABSENT FROM A SENDER BUILD.
 *
 * Everything below compiles only when ESP32DROP_SENDER is NOT defined. The two roles cannot
 * share a device -- a listener task's 32,768-byte stack and a sender's lifelong TLS client
 * context do not both fit beside AWDL with anything left for an application -- so the build
 * decides which one exists instead of leaving a runtime flag to catch the mistake later.
 *
 * What a sender build stops carrying, measured: 5,662 bytes of static allocation
 * (g_adlog 1,616, ad_respond's frame 1,440, g_ssl 552, g_entropy 420, g_srvcert 408,
 * g_disc_body 320, g_ask_body 256, g_tlsconf 196, and the rest), plus every byte of the
 * receive path's code. More importantly it stops carrying ad_begin() itself: a send sketch
 * that called it by mistake would take a 32 KB task stack at runtime and only find out by
 * running short of memory somewhere else. Now it will not link, which is the earliest
 * possible place to be told.
 *
 * The symmetry is deliberate: ad_cycle.cpp and the bundled BLE advertiser are absent from a
 * RECEIVING build for exactly the same reason, in exactly the same way.
 */
#if !defined(ESP32DROP_SENDER)

/* ad_port_esp32.cpp -- the AirDrop application layer on the ESP32 backend.
 *
 * TLS termination, the HTTP/1.1 responder, the DvZip/cpio decode, and the handoff of a
 * finished file to the sketch. The protocol decisions and their reasoning travel with the code, because
 * every one of them was paid for with a capture.
 *
 * WHAT IS *NOT* HERE, and where it went:
 *   - the framing, de-chunking and poisoning rules  -> ../core/ad_http.h  (host-tested)
 *   - request dispatch and desync detection         -> ../core/ad_serve.h (host-tested)
 *   - the mDNS codec                                -> ../core/ad_dnssd.h (host-tested)
 * That split is not cosmetic: those three are where the bugs were, and they are the
 * three that can be run on a laptop against scripted bytes and scripted CLOCKS.
 *
 * THE ONE RULE ACROSS THE LAYER BOUNDARY: this file may include
 * exactly one thing from src/awdl/ -- the public ESP32AWDL.h. The toolchain does NOT
 * enforce that (measured: ../../awdl/core/*.h resolves perfectly well from here),
 * so it is enforced by grep in tools/check-library.sh instead.
 */
#include <Arduino.h>          /* millis(), Serial -- the Serial uses leave at the strip */
#include <string.h>
#include <stdio.h>
#include <stdlib.h>
#include <fcntl.h>
#include <errno.h>
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "lwip/sockets.h"
#include "esp_heap_caps.h"    /* heap_caps_malloc(..., MALLOC_CAP_SPIRAM): decode in PSRAM */

#include "mbedtls/ssl.h"
#include "mbedtls/entropy.h"
#include "mbedtls/ctr_drbg.h"
#include "mbedtls/x509_crt.h"
#include "mbedtls/pk.h"
#include "mbedtls/net_sockets.h"
#include "mbedtls/ssl_cache.h"
#include "psa/crypto.h"

/* The ONE include from src/awdl, and the rule permits exactly this one: the public
   header. It brings awdl_ring.h, whose SPSC cursor the diagnostic ring below reuses
   rather than growing a second, untested copy. */
#include "../../ESP32AWDL.h"
#include "ad_port_esp32.h"
#include "../core/airdrop_cert.h"
#include "../core/ad_http.h"
#include "../core/ad_serve.h"
#include "../core/ad_bplist.h"
#include "../core/ad_dvzip.h"

/* gunzip via the ESP32-S3 mask-ROM miniz (tinfl). This is NOT an external package: the
 * function lives in the chip's ROM and is mapped by the vendor linker script
 * esp32s3.rom.ld (tinfl_decompress_mem_to_mem = 0x4000084c) shipped with the core.
 * Zero flash cost; decades-proven public-domain code baked into silicon. */
#define TINFL_DECOMPRESS_MEM_TO_MEM_FAILED ((size_t)(-1))
extern "C" size_t tinfl_decompress_mem_to_mem(void *pOut_buf, size_t out_buf_len,
                                              const void *pSrc_buf, size_t src_buf_len,
                                              int flags);
#define TINFL_FLAG_PARSE_ZLIB_HEADER 1   /* input is a zlib stream (78 xx ...), not raw */

// M3: a TCP listener on the AirDrop port (8770). If the iPhone opens the AirDrop
// /Discover connection to us on ch6, lwIP completes the 3-way handshake here and
// accept() fires -- the decisive proof that ch6 unicast connection is possible.
static volatile uint32_t g_tcp_accept = 0;
static volatile uint32_t g_tls_ok = 0;       // TLS handshake completed with a sender
static volatile uint32_t g_discover_ok = 0;  // answered HTTP POST /Discover (=> tile)
static volatile uint32_t g_ask_ok = 0;       // accepted a POST /Ask
static volatile uint32_t g_upload_ok = 0;    // received & decoded a POST /Upload image
static volatile uint32_t g_desync = 0;       // times the stream was out of frame

// Millisecond-stamped event log for the application layer. The symptom being
// chased ("the tile appears in the AirDrop window, then vanishes ~6s later") lives
// entirely in the few seconds after a successful /Discover, so every event in that
// window needs a timestamp on one greppable line. EV lines are meant to be read
// together offline, not individually.
// Formatted into a local buffer and emitted as a SINGLE write. Two tasks print to
// this port (frame processing and the TCP server), and Serial.printf is not atomic:
// out of 9153 captured lines exactly 2 were spliced together -- and one of those two
// swallowed the `http_idle_end ... why=timeout` line that was the sole evidence of a
// regression. A diagnostic channel that loses the one line that matters is worse than
// no channel, because it is trusted.

/* --- mDNS and connection counters ---------------------------------------------------
 * These were parked in AwdlDiag while the responder still lived in the link layer. They
 * count AirDrop events -- who asked, what we answered, which advertised port a sender
 * dialled -- so they belong here, with the code that writes them. */
static volatile uint32_t g_resp_tx = 0, g_resp_err = 0, g_query_seen = 0;
static volatile uint32_t g_notus = 0, g_ka_suppress = 0, g_dump_count = 0;
static volatile uint32_t g_tcp_tous = 0;
static volatile uint32_t g_syn_airdrop = 0, g_syn_pair1 = 0, g_syn_pair2 = 0, g_syn_other = 0;
static volatile uint16_t g_syn_other_port = 0;


