s-iwaki-d/ESP32Drop/ESP32Drop/src/airdrop/port/ad_port_esp32.cpp
/* ==========================================================================
 * mDNS: the advertisement, and the reply that has to leave from the frame path
 *
 * This is AirDrop POLICY -- which records we hold, which questions are ours, when a reply
 * is owed -- and it lives here rather than in the link layer. But it RUNS inside the AWDL
 * layer's receive tap, and that is not an accident of history: a query is answered at the
 * instant it is heard, because that is the only moment the querier is provably on channel
 * 6. Handing it to the netif queue instead can cost a full 1,048,576 us cycle.
 *
 * So the split is by ROLE rather than by layer. The codec is ad_dnssd.h, host-tested. The
 * policy is here. The timing -- inject now, un-gated -- is awdl_tx_ip6_now(), which the
 * link layer refuses to perform anywhere but inside this tap.
 * ========================================================================== */

/* The display name the two pairing services advertise. ONE definition: the encoder below
 * writes it into the PTR/SRV/TXT it emits, and ad_dnssd_known_answer_suppresses() compares
 * against it to decide whether a peer already holds that record. If those two ever
 * disagreed we would suppress a record we do not actually send, and go silently
 * undiscoverable -- the failure this whole area is built to avoid.
 *
 * ⚠️ It is a compile-time constant, and AirDrop.begin("name") cannot yet change it: what
 * the iPhone's share sheet actually DISPLAYS has never been measured, so nothing is
 * promised about it. */
#define AIRDROP_DNM "M5 Badge"

static struct AwdlIdentity g_id;      /* filled once, at ad_begin() */

/* --- the two responses that carry our identity ------------------------------------
 *
 * The name on the sender's share sheet is ReceiverComputerName in the /Discover reply --
 * measured by giving three candidate name fields three different values and
 * looking at the tile. So the reply cannot be a constant: bplist strings are
 * length-prefixed, and a different name moves every offset in the table and three 64-bit
 * fields in the trailer. Both replies are built at ad_begin() and live here.
 *
 * ReceiverModelName picks the icon the sender draws [A -- not separately verified]. It
 * stays "M5Stack"; a user who wants a different one is choosing from Apple's set, not
 * from ours, and there is no measurement behind any other value. */
#define AD_NAME_MAX 64
static uint8_t  g_disc_body[320], g_ask_body[256];
static uint32_t g_disc_len = 0, g_ask_len = 0;
static char     g_name[AD_NAME_MAX] = {0};

static bool ad_build_identity(const char *name) {
  static const char MEDIA[] = "{\"Version\":1}";
  struct AdBplistKV disc[] = {
    { "ReceiverComputerName",      AD_BP_STR,  name,  0 },
    { "ReceiverMediaCapabilities", AD_BP_DATA, MEDIA, (uint32_t)(sizeof(MEDIA) - 1) },
    { "ReceiverModelName",         AD_BP_STR,  "M5Stack", 0 },
  };
  struct AdBplistKV ask[] = {
    { "ReceiverComputerName", AD_BP_STR, name, 0 },
    { "ReceiverModelName",    AD_BP_STR, "M5Stack", 0 },
  };
  g_disc_len = ad_bplist_dict(g_disc_body, sizeof(g_disc_body), disc, 3);
  g_ask_len  = ad_bplist_dict(g_ask_body,  sizeof(g_ask_body),  ask,  2);
  return g_disc_len && g_ask_len;
}

/* A byte search is not an interface. Nine lines, kept local rather than exported, the way
 * the link layer keeps its own copy. This is the FIRST, cheap filter: a message that
 * mentions neither the service nor our own label cannot possibly be for us, and parsing
 * every mDNS packet on a busy network from the frame path is not free. Anything that
 * survives it is then properly parsed by ad_dnssd.h, which is where the real decision is
 * made -- the substring test alone answered 15 foreign instance labels from 7 source MACs
 * with our full 1,107-byte response. */
static bool mem_contains(const uint8_t *p, int n, const char *sub, int sl) {
  if (sl <= 0 || n < sl) return false;
  for (int i = 0; i + sl <= n; i++) if (memcmp(p + i, sub, (size_t)sl) == 0) return true;
  return false;
}
static bool contains_airdrop(const uint8_t *p, int n) {
  return mem_contains(p, n, "_airdrop", 8);
}

// Encode a dotted DNS name as length-prefixed labels ending in 0x00 (no
// compression — larger but unambiguous). Returns the advanced write pointer.
static uint8_t *put_dnsname(uint8_t *p, const char *name) {
  while (*name) {
    const char *dot = strchr(name, '.');
    int len = dot ? (int)(dot - name) : (int)strlen(name);
    *p++ = (uint8_t)len;
    memcpy(p, name, len); p += len;
    if (!dot) break;
    name = dot + 1;
  }
  *p++ = 0x00;
  return p;
}

// UDP checksum over the IPv6 pseudo-header (mandatory for IPv6).
static uint16_t udp6_checksum(const uint8_t *src, const uint8_t *dst,
                              const uint8_t *udp, int udplen) {
  uint32_t sum = 0;
  for (int i = 0; i < 16; i += 2) sum += (src[i] << 8) | src[i + 1];
  for (int i = 0; i < 16; i += 2) sum += (dst[i] << 8) | dst[i + 1];
  sum += (uint32_t)udplen;      // upper-layer length
  sum += 17;                    // next header = UDP
  for (int i = 0; i + 1 < udplen; i += 2) sum += (udp[i] << 8) | udp[i + 1];
  if (udplen & 1) sum += udp[udplen - 1] << 8;
  while (sum >> 16) sum = (sum & 0xffff) + (sum >> 16);
  uint16_t ck = ~sum;
  return ck ? ck : 0xffff;
}

// Emit one modern-AirDrop "pairing" service (PTR + SRV + TXT), matching the shape
// a real Mac's sharingd advertises for _applicationServicePairing._tcp /
// _appSvcPrePair._tcp. On the current macOS/iOS stack sharingd carries the AirDrop
// identity (sn/at/sid/dnm) through these services and appears to require them (plus
// possibly a BLE pre-pair) before it will open the /Discover connection to a peer.
// This is the diagnostic experiment: if adding these makes sharingd send us a TCP
// SYN, the missing identity surface was the gate; if not, BLE pre-pair is mandatory.
// svc = e.g. "_applicationServicePairing._tcp.local"; host has the AAAA already.
static uint8_t *put_pair_service(uint8_t *p, const char *svc, uint16_t port,
                                 const char *host) {
  const char *DNM = AIRDROP_DNM;
  char inst[80];
  snprintf(inst, sizeof(inst), "%s.%s", DNM, svc);   // "M5 Badge._applicationServicePairing._tcp.local"
  uint8_t *rl, *rs;
  // PTR: svc -> inst (shared record, no cache-flush)
  p = put_dnsname(p, svc);
  *p++ = 0; *p++ = 12; *p++ = 0x00; *p++ = 0x01;      // PTR, class IN
  *p++ = 0; *p++ = 0; *p++ = 0x11; *p++ = 0x94;       // TTL 4500
  rl = p; p += 2; rs = p; p = put_dnsname(p, inst);
  { uint16_t n = p - rs; rl[0] = n >> 8; rl[1] = n; }
  // SRV: inst -> host:port
  p = put_dnsname(p, inst);
  *p++ = 0; *p++ = 33; *p++ = 0x80; *p++ = 0x01;      // SRV, class IN flush
  *p++ = 0; *p++ = 0; *p++ = 0x00; *p++ = 0x78;       // TTL 120
  rl = p; p += 2; rs = p;
  *p++ = 0; *p++ = 0; *p++ = 0; *p++ = 0;             // priority, weight
  *p++ = port >> 8; *p++ = port & 0xff;
  p = put_dnsname(p, host);
  { uint16_t n = p - rs; rl[0] = n >> 8; rl[1] = n; }
  // TXT: inst -> sn / at / sid / dnm
  p = put_dnsname(p, inst);
  *p++ = 0; *p++ = 16; *p++ = 0x80; *p++ = 0x01;      // TXT, class IN flush
  *p++ = 0; *p++ = 0; *p++ = 0x00; *p++ = 0x78;
  rl = p; p += 2; rs = p;
  char at[24], sid[64], dnm[24];
  snprintf(at, sizeof(at), "at=%s", g_id.instance);       // 12-hex identity tag
  snprintf(sid, sizeof(sid), "sid=%s", g_id.pair_sid);
  snprintf(dnm, sizeof(dnm), "dnm=%s", DNM);
  const char *kv[4] = { "sn=com.apple.sharingd.AirDrop", at, sid, dnm };
  for (int i = 0; i < 4; i++) {
    uint8_t l = (uint8_t)strlen(kv[i]); *p++ = l; memcpy(p, kv[i], l); p += l;
  }
  { uint16_t n = p - rs; rl[0] = n >> 8; rl[1] = n; }
  return p;
}

