s-iwaki-d/ESP32Drop/ESP32Drop/src/airdrop/port/ad_port_esp32.cpp
// Build the DNS message (mDNS authoritative answer advertising our service).
static int build_mdns_msg(uint8_t *d) {
  uint8_t *p = d;
  *p++ = 0; *p++ = 0;              // id
  *p++ = 0x84; *p++ = 0x00;        // flags: response + authoritative
  *p++ = 0; *p++ = 0;              // qdcount
  *p++ = 0; *p++ = 12;             // ancount = 12 (_airdrop: PTR,SRV,TXT,AAAA,2xNSEC
                                   //   + 2 pairing services x (PTR,SRV,TXT))
  *p++ = 0; *p++ = 0;              // nscount
  *p++ = 0; *p++ = 0;              // arcount
  char inst[48], host[24];
  snprintf(inst, sizeof(inst), "%s._airdrop._tcp.local", g_id.instance);
  snprintf(host, sizeof(host), "%s.local", g_id.instance);
  uint8_t *rl; uint8_t *rs;
  // PTR: _airdrop._tcp.local -> <inst>
  p = put_dnsname(p, "_airdrop._tcp.local");
  *p++ = 0; *p++ = 12; *p++ = 0x00; *p++ = 0x01;          // type PTR, class IN
  *p++ = 0; *p++ = 0; *p++ = 0x11; *p++ = 0x94;           // TTL 4500
  rl = p; p += 2; rs = p; p = put_dnsname(p, inst);
  { uint16_t n = p - rs; rl[0] = n >> 8; rl[1] = n; }
  // SRV: <inst> -> port + host
  p = put_dnsname(p, inst);
  *p++ = 0; *p++ = 33; *p++ = 0x80; *p++ = 0x01;          // type SRV, class IN flush
  *p++ = 0; *p++ = 0; *p++ = 0x00; *p++ = 0x78;           // TTL 120
  rl = p; p += 2; rs = p;
  *p++ = 0; *p++ = 0; *p++ = 0; *p++ = 0;                 // priority, weight
  *p++ = AIRDROP_PORT >> 8; *p++ = AIRDROP_PORT & 0xff;   // port
  p = put_dnsname(p, host);
  { uint16_t n = p - rs; rl[0] = n >> 8; rl[1] = n; }
  // TXT
  p = put_dnsname(p, inst);
  *p++ = 0; *p++ = 16; *p++ = 0x80; *p++ = 0x01;
  *p++ = 0; *p++ = 0; *p++ = 0x00; *p++ = 0x78;
  rl = p; p += 2; rs = p;
  const char *txt = "flags=1019"; uint8_t tl = strlen(txt);   // 0x3FB = macOS "Everyone" default bitmask (Discover bit set). The DvZip bit does not gate the /Upload format -- modern macOS/iOS send DvZip regardless -- so keep the validated value the sender's removeInvalidNodes accepts.
  *p++ = tl; memcpy(p, txt, tl); p += tl;
  { uint16_t n = p - rs; rl[0] = n >> 8; rl[1] = n; }
  // AAAA: host -> our link-local
  p = put_dnsname(p, host);
  *p++ = 0; *p++ = 28; *p++ = 0x80; *p++ = 0x01;
  *p++ = 0; *p++ = 0; *p++ = 0x00; *p++ = 0x78;
  *p++ = 0; *p++ = 16; memcpy(p, g_id.ll, 16); p += 16;
  // NSEC for host: declares "AAAA(28) exists, A does NOT" so iOS getaddrinfo
  // stops waiting for an A record and resolves on our IPv6. (Apple's own stack
  // always sends NSEC; without it the phone re-queries A forever, as observed.)
  p = put_dnsname(p, host);
  *p++ = 0; *p++ = 47; *p++ = 0x80; *p++ = 0x01;    // NSEC, class IN flush
  *p++ = 0; *p++ = 0; *p++ = 0x00; *p++ = 0x78;
  rl = p; p += 2; rs = p;
  p = put_dnsname(p, host);                          // next-domain = self
  *p++ = 0x00; *p++ = 0x04; *p++ = 0x00; *p++ = 0x00; *p++ = 0x00; *p++ = 0x08; // AAAA bit
  { uint16_t n = p - rs; rl[0] = n >> 8; rl[1] = n; }
  // NSEC for instance: declares SRV(33) + TXT(16) exist
  p = put_dnsname(p, inst);
  *p++ = 0; *p++ = 47; *p++ = 0x80; *p++ = 0x01;
  *p++ = 0; *p++ = 0; *p++ = 0x00; *p++ = 0x78;
  rl = p; p += 2; rs = p;
  p = put_dnsname(p, inst);
  *p++ = 0x00; *p++ = 0x05; *p++ = 0x00; *p++ = 0x00; *p++ = 0x80; *p++ = 0x00; *p++ = 0x40;
  { uint16_t n = p - rs; rl[0] = n >> 8; rl[1] = n; }
  // Modern-AirDrop identity surface: advertise the two pairing services so
  // sharingd (which queries these alongside _airdrop and carries its own identity
  // only through them) has an identity to promote us from "discovered" to a
  // /Discover connection. Both target our existing host (its AAAA is above).
  p = put_pair_service(p, "_applicationServicePairing._tcp.local", 54763, host);
  p = put_pair_service(p, "_appSvcPrePair._tcp.local", 54764, host);
  return p - d;
}

/* Build the complete IPv6 packet -- v6 header, UDP, and the DNS message -- addressed to
 * the mDNS multicast group. The link layer adds the 802.11 wrap.
 *
 * The packet is assembled at frame + AWDL_TX_HEADROOM so awdl_tx_ip6_now() can prepend
 * the awdl_data header in place, with no copy. Keeping the 802.11 wrap out of this file
 * is the layer rule rather than a convenience: it is what lets the mDNS responder live in
 * src/airdrop at all. */
static int build_mdns_ip6(uint8_t *frame) {
  uint8_t *buf = frame + AWDL_TX_HEADROOM;
  static const uint8_t mip[16] = {0xff,0x02,0,0,0,0,0,0,0,0,0,0,0,0,0,0xfb};
  uint8_t dns[1280];               /* _airdrop(391) + 2 pairing services(~630) */
  int dlen   = build_mdns_msg(dns);
  int udplen = 8 + dlen;

  uint8_t *p = buf;
  *p++ = 0x60; *p++ = 0x00; *p++ = 0x00; *p++ = 0x00;
  *p++ = (udplen >> 8) & 0xff; *p++ = udplen & 0xff;
  *p++ = 17; *p++ = 255;                                  /* UDP, hop limit 255 */
  memcpy(p, g_id.ll, 16); p += 16;
  memcpy(p, mip, 16);     p += 16;
  uint8_t *udp = p;
  *p++ = 0x14; *p++ = 0xe9; *p++ = 0x14; *p++ = 0xe9;     /* sport/dport 5353 */
  *p++ = (udplen >> 8) & 0xff; *p++ = udplen & 0xff;
  *p++ = 0x00; *p++ = 0x00;                               /* checksum, filled below */
  memcpy(p, dns, dlen); p += dlen;
  uint16_t ck = udp6_checksum(g_id.ll, mip, udp, udplen);
  udp[6] = ck >> 8; udp[7] = ck & 0xff;
  return (int)(p - buf);
}

/* THERE IS NO PERIODIC MULTICAST ANNOUNCEMENT, and that is a decision with evidence
 * behind it (BRIEF_mdns_decision.md), not an omission. The reasoning sits here, beside the
 * responder that carries the same records, because a reader who wants one will look here.
 *
 * It could not be transmitted. esp_wifi_80211_tx refuses a DATA frame whose addr1 has the
 * group bit set -- disassembled out of ieee80211_raw_frame_sanity_check: a group address
 * always "hits" cnx_node_search, which routes the frame into the strict path, where an AP
 * interface then demands (fc1 & 3) == 2 and our frames are 0. A unicast destination MISSES
 * that lookup and returns success immediately, which is why the reply below works and this
 * did not. Setting FromDS to satisfy the check is not a fix: no real AWDL device emits
 * that shape, and it re-reads addr2 as the BSSID.
 *
 * It is also not load-bearing, which is what makes its absence a decision rather than a
 * hole:
 *   - Every record it carried, all twelve, is carried by the REPLY below -- ad_respond()
 *     does not look at the question and returns the same message.
 *   - Peers do ask. 387 decoded queries from the capture corpus: 186 for the _airdrop PTR,
 *     184 each for the two pairing service PTRs, 178 for our A record.
 *   - Across 35 separate runs in which mDNS was physically silent, 228 TCP connections
 *     were accepted and six uploads completed.
 *   - Discovery is carried by the AWDL service_response TLVs in every MIF action frame
 *     (awdl_frame.h), which do go out, 3.8 times a second.
 *
 * WHAT THIS GIVES UP, stated plainly: reaching a peer that has NOT asked. Nothing in the
 * record required that, but nothing in the record TESTED it either -- every capture is of
 * a device that had seen this badge before. A cold, never-paired device is the experiment
 * that could overturn this, and it is why this reasoning is written down rather than left
 * implicit in an absent function.
 *
 * The announce hook is deliberately kept: awdl_set_announce_cb() exists, the cadence fires
 * it in-window, and nothing registers. Its contract -- that awdl_tx_ip6_now() is legal for
 * the duration of the call -- is independently true and measured. What cannot be done is
 * the multicast destination, not the mechanism.
 */

/* The immediate reply, emitted on the frame task the instant a query is seen: one query
 * in, one reply out. */
static void ad_respond(const uint8_t querier[6]) {
  /* Its own buffer, never shared with the announcement's: the announcement runs on the
     cadence task at priority 2 and this runs on the frame task at 3, so the frame task
     can preempt a half-built announcement. That is why there were two static buffers
     before this code moved, and it is still why. */
  static uint8_t frame[AWDL_TX_HEADROOM + 1400];
  int n = build_mdns_ip6(frame);
  /* UNICAST to the querier, not multicast to ff02::fb, and that is measured rather than
   * preferred. esp_wifi_80211_tx refuses a DATA frame whose addr1 is a group address:
   * mDNS to 33:33:00:00:00:fb was rejected 100 % of the time, and the netif's own traffic
   * shows the same split (20 unicast accepted, 7 multicast refused in one 35-second
   * window). The case for multicast is that these queries are QM (class 0x0001, multicast
   * response expected) -- true, and moot for a frame that never leaves the driver. A
   * unicast reply the querier receives beats a QM-correct one it never sees. */
  if (awdl_tx_ip6_now(querier, frame, (size_t)n) == 0) g_resp_tx++; else g_resp_err++;
}

/* THE RX TAP. Runs on the AWDL frame task. Invariant: no Serial, no lwIP, no blocking --
 * awdl_diag_stage() and awdl_tx_ip6_now() are the only legal side effects.
 *
 * iplen is the length of the IPv6 packet, so dns_avail is iplen - 48 exactly (40 bytes of
 * v6 header plus 8 of UDP). That is what preserves the FCS fix across this seam: the
 * promiscuous callback's frame length carries the 4-byte 802.11 FCS, and taking the DNS
 * length from the UDP header instead was measured to be right in 156 of 156 dumps. */
static void ad_rx_tap(void *, const uint8_t src[6], const uint8_t *ip6, size_t iplen) {
  if (iplen < 48) return;
  uint8_t nh = ip6[6];
  if (nh == 17) {
    uint16_t sport = (ip6[40] << 8) | ip6[41], dport = (ip6[42] << 8) | ip6[43];
    if (dport != 5353 && sport != 5353) return;
    const uint8_t *dns = &ip6[48];
    int dns_avail = (int)iplen - 48;
    int udp_dlen  = (int)((((uint16_t)ip6[44]) << 8) | ip6[45]) - 8;
    int dns_len   = (udp_dlen >= 0 && udp_dlen <= dns_avail) ? udp_dlen : dns_avail;
      // Relevant = it mentions the _airdrop service OR our own instance/host id.
      // The phone's ADDRESS query "<id>.local A" does NOT contain "_airdrop", so
      // matching our instance id is essential to answer address resolution.
      bool relevant = contains_airdrop(dns, dns_len) ||
                      mem_contains(dns, dns_len, g_id.instance, strlen(g_id.instance));
      if (dns_len > 12 && relevant) {
        bool is_query = !(dns[2] & 0x80);
        int ka_dec = -1;   // -1 not a query, 0 replied, 1 known-answer suppressed, 2 not ours
        if (is_query) {
          g_query_seen++;
          // RFC 6762 7.1: do not answer a question whose answer the querier already
          // holds. We never honoured it, and it is not a nicety here -- a reply is 1,107
          // bytes built and injected from THIS task, measured 3,400-7,379us against a
          // 319us baseline. Measured over 101 captured queries, 23 carry every record we
          // would send. The decision is a pure function with 25 host tests
          // (tools/test-dnssd.sh), most of which assert it REFUSES to suppress: every way
          // it can be wrong ends with the badge quietly undiscoverable.
          // Three ways this ends, and only one of them transmits.
          //
          // The `relevant` test above is a raw substring match -- it passes any message
          // mentioning "_airdrop", including another device resolving ITS OWN instance.
          // Measured over 114 captured queries, 61 (54%) ask for nothing we hold and were
          // answered anyway, with the full 1,107-byte response. That is the largest single
          // source of the reply traffic whose cost is 3,400-7,379us of frame-path time.
          //
          // Both new tests are written to fail towards ANSWERING: a message that will not
          // parse, a name that will not resolve, a question count we cannot walk -- all of
          // them reply exactly as the old filter did. Only a query fully parsed, in which
          // no question names a record we hold, is dropped.
          struct AdDnssdOwn own = { g_id.instance, AIRDROP_DNM };
          if (!ad_dnssd_asks_us(dns, dns_len, &own))                     { ka_dec = 2; g_notus++; }
          else if (ad_dnssd_known_answer_suppresses(dns, dns_len, &own)) { ka_dec = 1; g_ka_suppress++; }
          else                            { ka_dec = 0; ad_respond(src); }
        }
        // Dump the phone's (non-self) _airdrop DNS bytes for offline decode, so
        // we can see EXACTLY what it asks/announces. Capped to avoid flooding.
        // Spend the budget on what is RARE, not on what is common. A dropped reply
        // (ka_dec > 0) is the event worth having bytes for -- it is the decision that
        // could make us undiscoverable -- and it is rare by construction, so it bypasses
        // the rate limit entirely. Ordinary answered queries take the budget. Without
        // this the instrument captured 37 uninteresting queries and lost all four
        // interesting ones in the same window, which is the wrong way round.
        if (memcmp(src, g_id.mac, 6) != 0 && (ka_dec > 0 || awdl_diag_budget_ok())) {
          g_dump_count++;
          char hdr[96];
          // ka= carries the suppression decision for these exact bytes. The dump already
          // contains the query, so the decision and its input travel together and any
          // offline re-run of ad_dnssd_known_answer_suppresses() on the hex either agrees
          // or has found a wiring bug. Without it, "kasup=0" is indistinguishable from
          // "the function is never actually reached".
          snprintf(hdr, sizeof(hdr), "MDNS qr=%d src=%02x%02x%02x%02x%02x%02x len=%d ka=%d ",
                   is_query ? 0 : 1, src[0], src[1], src[2], src[3], src[4],
                   src[5], dns_len, ka_dec);
          awdl_diag_stage(hdr, dns, dns_len);   // DUMP_MAX clamps; see stage_dump
        }
      }
  } else if (nh == 6) {
    const uint8_t *dst = &ip6[24];
    if (memcmp(dst, g_id.ll, 16) == 0) {               // to OUR address = iPhone connecting!
      g_tcp_tous++;
      uint8_t flags = iplen >= 54 ? ip6[40 + 13] : 0;  // TCP flags byte
      uint16_t dport = (ip6[42] << 8) | ip6[43];
      // Which of our ADVERTISED ports does the sender actually dial? We publish three
      // in mDNS -- _airdrop._tcp on 8770, _applicationServicePairing._tcp on 54763 and
      // _appSvcPrePair._tcp on 54764 -- but bind() only 8770, so a connection to
      // either pairing port gets a RST from lwIP. Earlier notes credited those pairing
      // records with the discovery-to-connection promotion, which may well be the
      // identity TXT they carry rather than the ports; this counts SYNs per port so
      // the question is answered by observation before anything is changed.
      if (flags & 0x02) {                            // SYN
        if      (dport == 8770)  g_syn_airdrop++;
        else if (dport == 54763) g_syn_pair1++;
        else if (dport == 54764) g_syn_pair2++;
        else                   { g_syn_other++; g_syn_other_port = dport; }
      }
      // SNIFFER-ONLY, same reason as NS-TO-US above. sport is declared here rather than
      // with dport because this line is its only reader, so the receiver build does not
      // carry an unused local.
    }
  }
}

