s-iwaki-d/ESP32Drop/ESP32Drop/src/airdrop/port/ad_port_esp32.cpp
/* ---- staged diagnostics: the library does not own Serial ------------------------
 *
 * Every diagnostic line the AirDrop layer produces is now COPIED INTO A RING and written
 * out by whoever calls ad_diag_read_line() -- in practice the sketch's loop(). Three
 * reasons, in order of how much they cost when ignored:
 *
 * 1. A library must not decide that a user's Serial port is its log. There is no
 *    setLogSink() either: a sink is a callback, a callback runs on whatever task called
 *    it, and USBCDC::write busy-spins without yielding for up to 250 ms
 *    (cores/esp32/USBCDC.cpp) -- fifteen times one AW. Pull, never push.
 * 2. These lines were written from the TLS task. Serial.printf is not atomic, and this
 *    project has already lost the single line of evidence for a regression to two
 *    interleaved writes.
 * 3. Dropping is correct when the ring is full, and is counted. Blocking a protocol task
 *    to wait for a UART is how a diagnostic becomes an outage.
 *
 * SPSC, one producer (the TLS task) and one consumer, using the same cursor and the same
 * barrier discipline as the frame ring -- awdl_ring.h, which has 19 host checks. That is
 * the ONE thing this file takes from the AWDL layer, through the public header, which is
 * exactly what the layering rule in tools/check-library.sh permits.
 */
/* -DAD_DIAG_DETAIL turns on the instruments that answer OPEN QUESTIONS rather than report
 * the device's state: the TLS session-cache probes, the listener's stack high-water sample,
 * and the once-a-second listener-loop line. It is off by default because the ring below
 * holds eight slots and a per-second producer spends one of them every second -- the lines
 * a reader actually came for are the rare ones, and they are the ones a steady drip evicts.
 * Nothing outside this file's diagnostics changes with it: no frame is built differently,
 * no byte is parsed differently, and no counter reported through ad_stats_read() moves. */
#ifdef AIRDROP_CH_DUMP
#define AD_DIAG_SLOTS 64          /* the CH witness bursts ~50 lines per adoption */
#else
#define AD_DIAG_SLOTS 8
#endif
#define AD_DIAG_LINE  200
struct AdDiagRing { struct AwdlRing cur; char slot[AD_DIAG_SLOTS][AD_DIAG_LINE]; };
static struct AdDiagRing g_adlog;

static bool ad_diag_stage(const char *line, int n) {
  if (!g_adlog.cur.mask) return false;        /* before ad_begin(): nowhere to put it */
  if (n <= 0) return false;
  if (n > AD_DIAG_LINE - 1) n = AD_DIAG_LINE - 1;
  int slot = awdl_ring_reserve(&g_adlog.cur);
  if (slot < 0) return false;                 /* counted in g_adlog.cur.drops */
  memcpy(g_adlog.slot[slot], line, (size_t)n);
  g_adlog.slot[slot][n] = 0;
  awdl_ring_commit(&g_adlog.cur);
  return true;
}

size_t ad_diag_read_line(char *dst, size_t cap) {
  int slot = awdl_ring_peek(&g_adlog.cur);
  if (slot < 0 || !cap) return 0;
  size_t n = strlen(g_adlog.slot[slot]);
  if (n > cap - 1) n = cap - 1;
  memcpy(dst, g_adlog.slot[slot], n);
  dst[n] = 0;
  awdl_ring_release(&g_adlog.cur);
  return n;
}

#ifdef AIRDROP_BODY_KEEP
/* Raw-body handoff for the probe build. Same release-flag discipline as g_arch_ready:
   the TLS task publishes g_body_ready LAST, loopTask reads it first. */
static uint8_t          *g_body_block = nullptr;
static uint32_t          g_body_len   = 0;
static volatile bool     g_body_ready = false;
#endif

#ifdef AIRDROP_BODY_KEEP
uint32_t ad_body_peek(const uint8_t **p) {
  if (!g_body_ready) return 0;                 // acquire: read the flag before the pointer
  if (p) *p = g_body_block;
  return g_body_len;
}
void ad_body_release(void) {
  if (!g_body_ready) return;
  heap_caps_free(g_body_block);
  g_body_block = nullptr; g_body_len = 0; g_body_ready = false;
}
#endif

uint32_t ad_diag_dropped(void) { return g_adlog.cur.drops; }

/* Formats into a local buffer and stages it. The trailing newline stays in the format
   string exactly as it was when these were Serial.printf, so the output is unchanged. */
#define AD_LOG(fmt, ...) do { \
    char _l[AD_DIAG_LINE]; \
    int _n = snprintf(_l, sizeof(_l), fmt, ##__VA_ARGS__); \
    if (_n > 0) ad_diag_stage(_l, _n < (int)sizeof(_l) ? _n : (int)sizeof(_l) - 1); \
  } while (0)

#define EV(fmt, ...) AD_LOG("EV %lu " fmt "\n", (unsigned long)millis(), ##__VA_ARGS__)
static uint32_t g_http_exit_ms = 0;   // when we last returned from serve_http
static uint32_t g_http_enter_ms = 0;  // when we last entered it
static uint32_t g_disc_ms = 0;        // when we last answered /Discover
static uint32_t g_ask_ms = 0;         // when we last answered /Ask (the /Upload clock)


// ---- received-image handoff (TLS task decodes -> main task draws) ------------
// All SPI/display I/O must stay on the main task; the TLS task only decodes into
// PSRAM and publishes the result. g_img_ready is set LAST as the release flag.
/* When the receive state last CHANGED. "Receiving" is a claim about now, and it used to be
 * set by the /Ask reply and cleared only by a completed upload -- so a sender that answered
 * /Ask and then never sent anything (observed: reconnected, finished TLS, then ten seconds
 * of silence and gone) left the badge saying "Receiving" indefinitely. It is the same
 * mistake as awdl_status_discoverable's, in a different layer: a state reported from an
 * event that happened rather than from one that is still happening. */
#define AD_RX_STALL_MS 20000u
static volatile uint32_t g_rx_touch_ms = 0;
static volatile bool     g_rx_active   = false;   // transfer in progress: "Receiving" UI
static volatile uint32_t g_rx_bytes    = 0;       // compressed bytes received so far
// A finished transfer is a cpio ARCHIVE, not an image. The TLS task publishes the whole
// decoded block and does no parsing; ad_poll() walks it on the caller's task and hands over
// every regular file it holds. Parsing on the consumer side is deliberate: the walk is
// bounds-checked code fed by a remote sender (ad_cpio.h, 35 host checks under ASan), and
// there is no reason to run it inside the task that is holding the TLS session open.
static volatile bool     g_arch_ready  = false;   // an archive awaits delivery
static uint8_t          *g_arch_block  = nullptr; // PSRAM block, freed after delivery
static const uint8_t    *g_arch_buf    = nullptr; // the cpio within the block
static volatile uint32_t g_arch_len    = 0;
static volatile uint32_t g_files_ok    = 0;
static volatile uint32_t g_img_err     = 0;       // undecodable/oversize transfers
static char              g_img_errmsg[40] = {0};
// Accumulation budget for bodies that are NOT decoded in flight (gzip, bare cpio,
// and any shape the streaming sink declines): those still hold ~compressed +
// ~decompressed at once, so the old cap and the old reasoning stand for them.
// A DvZip body no longer pays this double occupancy -- it is decoded record by
// record while it arrives (struct RxPump below) and its ceiling is the PSRAM free
// block itself, minus the residue buffer. This constant also names the ceiling a
// HEALTHY device must be able to offer: when streaming cannot allocate even this
// much, the failure is reported as the device's (507), not the file's (413).
/* The archive ceiling. Was a hard 6 MiB; now whatever ad_begin() was given, because the
   sketch is the only thing that knows how much PSRAM it wants left for itself -- see the
   note on ad_begin() in the header. RX_MAX_AUTO is the bound used when the caller passes 0:
   still 6 MiB, so behaviour is unchanged for anyone who does not care. */
#define RX_MAX_AUTO (6u * 1024 * 1024)
static uint32_t          g_rx_max      = RX_MAX_AUTO;   /* policy, set by ad_begin() */
static volatile uint32_t g_rx_max_eff  = 0;             /* what a transfer actually got */

// ---- TLS server config, built once ------------------------------------------
// Reported in STAT even on the SNIFFER build (which has no mbedTLS at all), so
// these three live OUTSIDE the guard below.
static const char              *g_tls_alg = "none";   // "EC"/"RSA" once cert loads
static int                      g_ec_crt_err = 0, g_ec_key_err = 0;  // why EC fell back
static mbedtls_entropy_context  g_entropy;
static mbedtls_ctr_drbg_context g_ctr_drbg;
static mbedtls_x509_crt         g_srvcert;
static mbedtls_pk_context       g_pkey;
static mbedtls_ssl_config       g_tlsconf;
static mbedtls_ssl_context      g_ssl;          // ONE session, reused via session_reset
static mbedtls_net_context      g_net;          // .fd swapped to the active connection
static mbedtls_ssl_cache_context g_cache;       // abbreviated handshake on retries
static bool                     g_tls_ready = false;

#ifdef AD_DIAG_DETAIL
// Probes around the session cache, to answer "why does resumption not fire on
// most reconnects" WITHOUT guessing. That is an open question, not a shipping
// feature, so it is behind AD_DIAG_DETAIL; with the define off mbedTLS gets its
// own cache callbacks directly and resumption behaves identically.
// The three distinguishable worlds:
//   - no `tlscache get` line before tlsok  -> the client offered no session ID
//     (mbedtls only consults the cache for a non-empty ID in the ClientHello)
//   - `get ... miss`                       -> client offered an ID we don't hold
//   - `get ... HIT` + small hs_ms          -> abbreviated handshake worked
// `set -> rc!=0` would mean the cache refused to store (e.g. alloc failure) --
// a path that is otherwise invisible, because mbedtls ignores f_set_cache's return.
static int tls_cache_get_probe(void *data, unsigned char const *id, size_t idlen,
                               mbedtls_ssl_session *sess) {
  int r = mbedtls_ssl_cache_get(data, id, idlen, sess);
  EV("tlscache get id=%02x%02x%02x%02x len=%u -> %s", idlen > 0 ? id[0] : 0,
     idlen > 1 ? id[1] : 0, idlen > 2 ? id[2] : 0, idlen > 3 ? id[3] : 0,
     (unsigned)idlen, r == 0 ? "HIT" : "miss");
  return r;
}
static int tls_cache_set_probe(void *data, unsigned char const *id, size_t idlen,
                               const mbedtls_ssl_session *sess) {
  int r = mbedtls_ssl_cache_set(data, id, idlen, sess);
  EV("tlscache set id=%02x%02x%02x%02x len=%u -> rc=%d", idlen > 0 ? id[0] : 0,
     idlen > 1 ? id[1] : 0, idlen > 2 ? id[2] : 0, idlen > 3 ? id[3] : 0,
     (unsigned)idlen, r);
  return r;
}
#endif  /* AD_DIAG_DETAIL */

static void airdrop_tls_init() {
  if (g_tls_ready) return;
  /* A RETRY MUST GIVE BACK WHAT THE LAST ATTEMPT TOOK.
   *
   * tcp_listen_task calls this once a second until it succeeds, and every call used to
   * re-init the same static contexts without freeing them. mbedtls_entropy_init allocates
   * a message-digest accumulator; re-initialising over it drops the pointer and leaks it.
   * A cert or key parsed by a pass that failed later leaks the same way.
   *
   * That made the retry a ONE-WAY RATCHET. Whatever caused the first failure -- a
   * transient shortage while the radio was busy, say -- the loop then ground internal RAM
   * down a few hundred bytes a second until even the accumulator would not fit, and from
   * then on every pass failed at seeding FOREVER, long after the original cause had
   * passed. Measured: 417 consecutive "[tls] seed -0x0034" lines over a 416-second
   * capture, with free internal heap pinned at 24 bytes and dipping to 0. The device was
   * not recovering because it could not: it was eating the memory it needed to recover.
   *
   * With the frees below, a pass that fails costs nothing, so a transient failure heals on
   * the next tick instead of becoming permanent. */
  static bool tried = false;
  if (tried) {
    mbedtls_ssl_config_free(&g_tlsconf);
    mbedtls_pk_free(&g_pkey);
    mbedtls_x509_crt_free(&g_srvcert);
    mbedtls_ctr_drbg_free(&g_ctr_drbg);
    mbedtls_entropy_free(&g_entropy);
  }
  tried = true;
  mbedtls_entropy_init(&g_entropy);
  mbedtls_ctr_drbg_init(&g_ctr_drbg);
  mbedtls_x509_crt_init(&g_srvcert);
  mbedtls_pk_init(&g_pkey);
  mbedtls_ssl_config_init(&g_tlsconf);
  const char *pers = "ESP32Drop-tls";
  int r;
  psa_crypto_init();   // some EC/PK paths route through PSA (MBEDTLS_PSA_CRYPTO_C on)
  // EC P-256 cert: ECDSA sign is ~10-30ms vs RSA-2048's ~300ms. That speed is the
  // whole game here: the response must be generated inside the ~52ms ch6 window so
  // it reaches the sender before sharingd abandons the connection. (RSA sign blew
  // past the window -> reply landed a window late -> handshake never converged.)
  if ((r = mbedtls_ctr_drbg_seed(&g_ctr_drbg, mbedtls_entropy_func, &g_entropy,
        (const unsigned char *)pers, strlen(pers)))) {
    /* SAY HOW MUCH ROOM THERE WAS. "[tls] seed -0x0034" cost an hour: it names the failure
       and not the reason, and the reason here is almost always that this library's mbedTLS
       is built with CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC and internal RAM ran out at exactly
       this moment. Adding 2,088 bytes of static to the sketch was enough to do it, and the
       only visible symptom was that the device stopped appearing in the AirDrop share
       sheet -- with the radio, the election and the cadence all reporting healthy. */
    AD_LOG("[tls] seed failed -0x%04x, %lu B internal heap free (mbedTLS cannot use PSRAM)\n",
           -r, (unsigned long)esp_get_free_internal_heap_size());
    return;
  }
  int ec_ok = 0, rc, rk;
  rc = mbedtls_x509_crt_parse_der(&g_srvcert, AIRDROP_CRT_EC_DER, AIRDROP_CRT_EC_DER_LEN);
  rk = rc ? -1 : mbedtls_pk_parse_key(&g_pkey, AIRDROP_KEY_EC_DER, AIRDROP_KEY_EC_DER_LEN,
                    NULL, 0, mbedtls_ctr_drbg_random, &g_ctr_drbg);
  g_ec_crt_err = rc; g_ec_key_err = rk;
  if (!rc && !rk) { ec_ok = 1; }
  else AD_LOG("[tls] EC(DER) crt=-0x%04x key=-0x%04x -> RSA fallback\n", -rc, -rk);
  if (!ec_ok) {
    // Fallback so we always have a working server even if EC parse fails.
    mbedtls_x509_crt_free(&g_srvcert); mbedtls_x509_crt_init(&g_srvcert);
    mbedtls_pk_free(&g_pkey); mbedtls_pk_init(&g_pkey);
    if ((r = mbedtls_x509_crt_parse(&g_srvcert, (const unsigned char *)AIRDROP_CRT_RSA,
          strlen(AIRDROP_CRT_RSA) + 1))) { AD_LOG("[tls] RSA crt -0x%04x\n", -r); return; }
    if ((r = mbedtls_pk_parse_key(&g_pkey, (const unsigned char *)AIRDROP_KEY_RSA,
          strlen(AIRDROP_KEY_RSA) + 1, NULL, 0, mbedtls_ctr_drbg_random, &g_ctr_drbg))) {
          AD_LOG("[tls] RSA key -0x%04x\n", -r); return; }
  }
  if ((r = mbedtls_ssl_config_defaults(&g_tlsconf, MBEDTLS_SSL_IS_SERVER,
        MBEDTLS_SSL_TRANSPORT_STREAM, MBEDTLS_SSL_PRESET_DEFAULT))) {
        AD_LOG("[tls] defaults -0x%04x\n", -r); return; }
  mbedtls_ssl_conf_authmode(&g_tlsconf, MBEDTLS_SSL_VERIFY_NONE);   // Everyone: no client cert
  mbedtls_ssl_conf_rng(&g_tlsconf, mbedtls_ctr_drbg_random, &g_ctr_drbg);
  mbedtls_ssl_conf_min_tls_version(&g_tlsconf, MBEDTLS_SSL_VERSION_TLS1_2);
  // Read timeout applies only to the HTTP phase (which uses the recv_timeout bio);
  // the TLS handshake runs non-blocking via select() and ignores this.
  mbedtls_ssl_conf_read_timeout(&g_tlsconf, 10000);
  // Session cache: sharingd's follow-up/retry connections resume abbreviated
  // (1-RTT, no cert, no EC sign) -- huge on this ~1-window/second link.
  mbedtls_ssl_cache_init(&g_cache);
  mbedtls_ssl_cache_set_max_entries(&g_cache, 4);
#ifdef AD_DIAG_DETAIL
  mbedtls_ssl_conf_session_cache(&g_tlsconf, &g_cache,
                                 tls_cache_get_probe, tls_cache_set_probe);
#else
  mbedtls_ssl_conf_session_cache(&g_tlsconf, &g_cache,
                                 mbedtls_ssl_cache_get, mbedtls_ssl_cache_set);
#endif
  if ((r = mbedtls_ssl_conf_own_cert(&g_tlsconf, &g_srvcert, &g_pkey))) {
        AD_LOG("[tls] own_cert -0x%04x\n", -r); return; }
  // Allocate the ONE ssl context now (34KB I/O buffers). session_reset() between
  // connections reuses these buffers -> no per-connection alloc churn/fragmentation.
  mbedtls_ssl_init(&g_ssl);
  if ((r = mbedtls_ssl_setup(&g_ssl, &g_tlsconf))) {
        AD_LOG("[tls] ssl_setup -0x%04x\n", -r); return; }
  g_tls_ready = true;
  g_tls_alg = mbedtls_pk_get_name(&g_pkey);
  AD_LOG("[tls] server config ready (%s, verify=none, select-loop)\n", g_tls_alg);
}

static int ssl_write_all(mbedtls_ssl_context *ssl, const unsigned char *p, int len) {
  int off = 0;
  while (off < len) {
    int r = mbedtls_ssl_write(ssl, p + off, len - off);
    if (r == MBEDTLS_ERR_SSL_WANT_READ || r == MBEDTLS_ERR_SSL_WANT_WRITE) continue;
    if (r <= 0) return r;
    off += r;
  }
  return off;
}

// The TLS read timeout is a per-config value that mbedtls reads on every recv, so
// it can be retuned between phases of one session. One flat 10s value was very
// expensive: it is the price of every stall, and two different stalls were measured
// costing 10s each in a single /Discover exchange.
static void set_rd_timeout(uint32_t ms) { mbedtls_ssl_conf_read_timeout(&g_tlsconf, ms); }

// The byte source ad_http.h reads through. Its contract -- >0 bytes, 0 for a
// TIMEOUT, <0 for a close -- is exactly mbedtls's, and keeping the three distinct is
// the whole reason the layer can tell "nothing arrived yet" from "the peer is gone".
#ifdef HTTP_TRACE
/* ---- HTTP_TRACE: what a REAL Apple sender's /Discover and /Ask requests contain -------------
 *
 * The reference the send path's bplist writer is checked against. airdrop_cert.h's blobs
 * are RECEIVER-shaped, so a sender's request bodies are their own measurement,
 * and this is how that measurement is taken.
 *
 * IT SITS IN http_src_mbedtls(), on the one path every decrypted byte takes, so it cannot
 * go inert -- and it counts what it captured. That placement is what makes it worth
 * having: the /Ask -> /Upload transition is where desynchronisation hides, and the one
 * occurrence on record was caught only because a chunk-size line happened to look like a
 * hex number ("req 1F7BB"). A tap anywhere off the byte path cannot find that.
 *
 * DECRYPTED, unlike AIRDROP_CH_DUMP -- that one wraps the net BIO and therefore sees
 * ciphertext plus the plaintext ClientHello, which answers a different question.
 *
 * ⚠️ THE OUTPUT CONTAINS THE SENDER'S APPLE ID VALIDATION RECORD. It is capture of a
 * real person's identity material. It belongs in logs/ (which .gitignore excludes) and
 * MUST NOT be committed, and must not go into testdata/ even scrubbed.
 *
 * 4 KB per connection is deliberate: it covers /Discover, the /Ask body, the /Upload
 * request line and headers, and the first chunk header -- the entire region in question
 * -- without drowning the serial link in a 265 KB image. */
#ifndef HTTP_TRACE_MAX
#define HTTP_TRACE_MAX 4096
#endif
/* IT BUFFERS INTO PSRAM AND THE SKETCH DUMPS IT LATER, and that is not a refinement --
 * the first version staged hex lines directly and lost almost everything. Measured: of a
 * body the reader demonstrably consumed in full ("body read done ... to=0"), only 224
 * bytes reached the serial link. ht_put runs on the TLS task and can stage a hundred
 * lines in a millisecond; the ring is drained by loop() over USB CDC at ~45 B/ms. The
 * ring is drop-counted rather than blocking -- correctly, since a protocol task must not
 * wait on a log -- so the overflow is silent and looks exactly like a body that was never
 * read. AIRDROP_BODY_KEEP already solved this shape: hold the bytes, let the sketch pace
 * the output. Same pattern here. */
static uint8_t *g_ht_buf = NULL;      /* PSRAM: mbedTLS may not have this memory anyway */
static int      g_ht_len = 0;         /* bytes held                                     */
static int      g_ht_off = 0;         /* cumulative decrypted-stream offset             */
static bool     g_ht_full = false;

