s-iwaki-d/ESP32Drop/ESP32Drop/src/airdrop/port/ad_port_esp32.cpp
static void ht_arm(void) {
  if (g_ht_len > 0) return;           /* a previous capture is still waiting to be read */
  if (!g_ht_buf) g_ht_buf = (uint8_t *)heap_caps_malloc(HTTP_TRACE_MAX, MALLOC_CAP_SPIRAM);
  g_ht_off = 0; g_ht_full = false;
}

static void ht_put(const unsigned char *b, int n) {
  if (!g_ht_buf || g_ht_full || n <= 0) return;
  int room = HTTP_TRACE_MAX - g_ht_off;
  if (n > room) { n = room; g_ht_full = true; }
  if (n > 0) { memcpy(g_ht_buf + g_ht_off, b, (size_t)n); g_ht_off += n; g_ht_len = g_ht_off; }
  if (g_ht_full) EV("httptrace full at %d B", g_ht_off);
}

/* Lend the capture to the sketch. The library still owns the block; ht_trace_release()
 * frees the hold so the next connection can arm. Same contract as ad_body_peek(). */
uint32_t ht_trace_peek(const uint8_t **p) { *p = g_ht_buf; return (uint32_t)g_ht_len; }
void     ht_trace_release(void) { g_ht_len = 0; g_ht_off = 0; g_ht_full = false; }
#endif  /* HTTP_TRACE */

static int http_src_mbedtls(struct HttpRdr *r, unsigned char *buf, int len) {
  mbedtls_ssl_context *ssl = (mbedtls_ssl_context *)r->ctx;
  int ret;
  do { ret = mbedtls_ssl_read(ssl, buf, (size_t)len); }
  while (ret == MBEDTLS_ERR_SSL_WANT_READ || ret == MBEDTLS_ERR_SSL_WANT_WRITE);
  if (ret == MBEDTLS_ERR_SSL_TIMEOUT) return 0;
  if (ret <= 0) return -1;
#ifdef HTTP_TRACE
  ht_put(buf, ret);
#endif
  return ret;
}
static void http_set_timeout(struct HttpRdr *r, uint32_t ms) {
  r->timeout_ms = ms; set_rd_timeout(ms);
}

// Firmware adapters for the transport-agnostic dispatch layer (ad_serve.h).
// serve() below fills an HttpServe with these; the same struct on the host test
// side points write/now/log at a capture buffer and a scripted clock.
static int  sv_write(struct HttpServe *s, const unsigned char *p, int n) {
  return ssl_write_all((mbedtls_ssl_context *)s->io, p, n);
}
static uint32_t sv_now(struct HttpServe *) { return millis(); }
static void sv_log(struct HttpServe *, const char *l) { EV("%s", l); }

static void set_nonblock(int fd, bool nb) {
  int fl = fcntl(fd, F_GETFL, 0);
  if (fl < 0) return;
  fcntl(fd, F_SETFL, nb ? (fl | O_NONBLOCK) : (fl & ~O_NONBLOCK));
}

// ---- /Upload receive + decode ----------------------------------------------
// The body is a gzip'd cpio (newc) archive: [de-chunk] -> [gunzip] -> publish the
// whole archive; ad_poll() walks it on the caller's task and hands over every
// regular file it holds. No type is privileged and none is discarded here -- the
// archive may carry several files and the sketch gets each one. All large buffers
// live in PSRAM (8MB); the TLS task never touches the display.

// Buffered reader over the TLS session so we can de-chunk byte-accurately. It is
// primed with any body bytes the header read already pulled in (`pre`), then
// pulls the rest from mbedtls_ssl_read. (The reader itself lives in ad_http.h so
// Arduino's auto-prototype pass sees the type -- see the note there.)
// ---- streaming DvZip decode ----------------------------------------------------
// The record framing and the drain live in ../core/ad_dvzip.h and are host-tested
// there. What is here is the part that genuinely needs the platform -- miniz and
// PSRAM -- and the policy for when either runs out.
//
// WHY THE DECODE MOVED INTO THE SINK. The order used to be: receive the whole
// compressed body -> answer 200 -> decode -> maybe fail. A PSRAM exhaustion during
// that decode was unreportable -- the 200 was already gone -- and the
// consequence was visible: the badge showed the transfer dead while the Mac sat on "Sending",
// then reported success. Decoding record by record WHILE receiving puts every
// decode failure BEFORE the response, where it is a receipt failure and is answered
// as 507/413/400. It also stops holding the compressed and decoded copies at once,
// which raises the transfer ceiling from ~3.7 MB to roughly the PSRAM free block
// minus the residue buffer (~7.1 MB) as a side effect.
//
// The response is NOT delayed by this, and that constraint is load-bearing: a
// response one window late is a transfer sharingd abandons (see ad_serve.h). The
// per-record inflate (~131 KB grain) costs tens of ms interleaved into a
// multi-second receive, and the only decode left between the last byte and the
// response is the held-back residue -- at most one record. The whole-body decode
// that used to sit after the response is exactly what this design removes.

enum { RXM_UNDECIDED = 0,   // fewer than 10 body bytes: no shape yet
       RXM_STREAM,          // DvZip signature seen: decode records as they complete
       RXM_RAW };           // anything else (gzip, bare cpio): accumulate, as always

enum { RXF_NONE = 0,
       RXF_OOM,             // this device could not give the memory -> 507
       RXF_CAP,             // the body outgrew what this device can ever hold -> 413
       RXF_INFLATE };       // a record's zlib would not inflate -> 400

struct RxPump {
  uint8_t  *out;            // decoded archive, PSRAM; ownership moves at handoff
  uint32_t  out_len, out_cap;
  uint32_t  in_total;       // body bytes ever appended -- sink->len is only the residue
  uint32_t  residue_prev;   // sink->len as this hook last left it, for the delta
  uint32_t  nrec, nstored;
  int       end;            // AdDvzipEnd of the FINAL drain; init to END_RUNNING
  uint8_t   mode;           // RXM_*
  uint8_t   fail;           // RXF_*, sticky
  bool      psram_limited;  // out_cap was capped by free PSRAM, not by any policy:
                            // turns a later CAP into 507 (device) instead of 413 (file)
};

/* Decode ONE complete record into the output block. Shared by the in-flight drain
   and the whole-buffer fallback below, so there is exactly one decoder.
   NO PER-RECORD LOGGING on success: the first version of the decode logged every
   record, an eighteen-line burst into an eight-slot ring, and the lines it evicted
   were the summary and the cut report -- the two it existed to produce. */
static bool rx_pump_emit(void *vp, const struct AdDvzipRec *rec, const uint8_t *payload) {
  struct RxPump *p = (struct RxPump *)vp;
  uint32_t room = p->out_cap - p->out_len;
  if (rec->stored) {
    /* A STORED RECORD IS A COPY, NOT A DECOMPRESSION. macOS switches to these once
       deflate stops paying on an already-compressed image -- measured, 6 of the 18
       records in a 2.35 MB photo. Feeding one to the inflater is what used to cut the
       stream and deliver half an archive. */
    if (rec->len > room) {
      p->fail = RXF_CAP;
      AD_LOG("DVZIP-CAP: stored record %lu wants %lu B, %lu B room\n",
             (unsigned long)(p->nrec + 1), (unsigned long)rec->len, (unsigned long)room);
      return false;
    }
    memcpy(p->out + p->out_len, payload, rec->len);
    p->out_len += rec->len; p->nrec++; p->nstored++;
    return true;
  }
  size_t got = tinfl_decompress_mem_to_mem(p->out + p->out_len, room,
                                           payload, rec->len, TINFL_FLAG_PARSE_ZLIB_HEADER);
  if (got == TINFL_DECOMPRESS_MEM_TO_MEM_FAILED) {
    /* mem_to_mem reports one bit: failed. WHICH failure decides the HTTP status --
       out of room is this device's problem, a broken zlib stream is the sender's --
       so split them by room: the measured record grain is 128 KiB uncompressed, and
       a conforming record given two grains of room cannot have run out of space. */
    p->fail = (room < 2u * AD_DVZIP_GRAIN) ? RXF_CAP : RXF_INFLATE;
    AD_LOG("DVZIP-REC: record %lu (%lu B zlib) failed with %lu B room -> %s\n",
           (unsigned long)(p->nrec + 1), (unsigned long)rec->len, (unsigned long)room,
           p->fail == RXF_CAP ? "cap" : "inflate");
    return false;
  }
  p->out_len += (uint32_t)got; p->nrec++;
  return true;
}

/* Adopt streaming only on the DvZip wire signature: a plausible first record length
   and a zlib header at offset 4 (or bit 31 -- a stored first record, never yet seen
   first but legal). gzip's 1f 8b and cpio's "07070" both read as absurd record
   lengths and fall to RXM_RAW, where the sink accumulates exactly as it always has.
   A genuine DvZip body that fails this test (first record over the sane cap) also
   falls to RAW and is STILL decoded -- once, at the end, through the same pump -- so
   the streaming test gates only WHEN decoding happens, never WHETHER. */
#define RX_REC_SANE (1u * 1024 * 1024)   /* largest measured compressed payload: 131,118 B */
static int rx_body_shape(const uint8_t *b, uint32_t n) {
  if (n < 10) return RXM_UNDECIDED;                    /* same floor as ad_dvzip_looks_like */
  uint32_t hdr = ((uint32_t)b[0] << 24) | ((uint32_t)b[1] << 16) |
                 ((uint32_t)b[2] << 8) | (uint32_t)b[3];
  uint32_t rl = ad_dvzip_reclen(hdr);
  if (rl == 0 || rl > RX_REC_SANE) return RXM_RAW;
  if (ad_dvzip_is_flagged(hdr)) return RXM_STREAM;
  if (b[4] != 0x78 || ((((uint32_t)b[4] << 8) | b[5]) % 31) != 0) return RXM_RAW;
  return RXM_STREAM;
}

/* The output block, allocated ONCE, all-or-nothing, the moment streaming is adopted.
 *
 * Upfront rather than grown, because growth is what failed before: a doubling realloc
 * of a multi-MB block needs old and new at once when it cannot extend in place, and
 * 4 MiB + 7 MiB does not fit in an 8 MiB part -- the same arithmetic that killed the
 * 2,352,506-byte transfer this redesign started from. One allocation also moves the
 * OOM to record one, where it is answered as 507 before megabytes have flown, instead
 * of at second 70 of a 71-second transfer. The slack is given back by a shrinking
 * realloc at the end, the move the receive path already used.
 *
 * RX_OUT_HEADROOM is what the transfer itself may still need beside the output: the
 * residue buffer is already allocated when this runs, so this covers only incidental
 * PSRAM use during the transfer. Ceiling arithmetic, measured base: 7,864,308 B
 * largest free block - 320 KiB residue - this headroom ~= 7.1 MB of decoded archive. */
static const uint32_t RX_OUT_HEADROOM = 384u * 1024;

static bool rx_pump_open(struct RxPump *p) {
  /* TAKE WHAT THE SKETCH ALLOWED, NOT WHAT PSRAM HAPPENS TO HAVE.
     This used to ask for largest_free_block - headroom, i.e. nearly all of PSRAM, for the
     length of every transfer. That is right for a badge that does nothing else and wrong
     for a sketch with its own buffers -- and the failure it produces is the sketch's
     allocation returning NULL, which is a worse place for it to land than here. So the
     ceiling is g_rx_max, and PSRAM only lowers it. */
  uint32_t largest = heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM);
  uint32_t avail = (largest > RX_OUT_HEADROOM) ? largest - RX_OUT_HEADROOM : 0;
  uint32_t want = (g_rx_max < avail) ? g_rx_max : avail;
  p->psram_limited = avail < g_rx_max;
  g_rx_max_eff = want;
  p->out = want ? (uint8_t *)heap_caps_malloc(want, MALLOC_CAP_SPIRAM) : nullptr;
  if (!p->out) {
    AD_LOG("RX-OOM: decode block of %lu B refused, %lu free / %lu largest in PSRAM\n",
           (unsigned long)want,
           (unsigned long)heap_caps_get_free_size(MALLOC_CAP_SPIRAM),
           (unsigned long)heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM));
    p->fail = RXF_OOM;
    return false;
  }
  p->out_cap = want;
  AD_LOG("RX-STREAM: DvZip signature, decode-while-receive, %lu B ceiling%s\n",
         (unsigned long)want, p->psram_limited ? " (PSRAM-limited)" : "");
  return true;
}

// PSRAM-backed sink for ad_http.h's chunked receiver.
/* Publishes progress as it happens. Called after every append, so the counter on the badge
   moves during a transfer instead of jumping from 0 to the total at the end. */
/* Set when a grow failed for want of memory, cleared at the start of each upload. It is
   the difference between 507 and 413 to the sender, and between "buy a smaller phone" and
   "this file is over the limit" to the user. */
static bool g_rx_grow_failed = false;

/* Called after every successful append; in RXM_STREAM it is also the decoder (the
   consuming-hook contract in ad_http.h). g_rx_bytes publishes TOTAL body bytes,
   which sink->len no longer is once records are being consumed out of it. */
static void rx_sink_progress(struct HttpSink *sk) {
  struct RxPump *p = (struct RxPump *)sk->ctx;
  p->in_total += sk->len - p->residue_prev;
  g_rx_bytes = p->in_total;
  g_rx_touch_ms = (uint32_t)(esp_timer_get_time() / 1000);
  if (p->mode == RXM_UNDECIDED && !p->fail) {
    p->mode = (uint8_t)rx_body_shape(sk->buf, sk->len);
    if (p->mode == RXM_STREAM && !rx_pump_open(p)) p->mode = RXM_RAW;  /* fail=RXF_OOM set */
  }
  if (p->mode == RXM_STREAM && !p->fail) {
    /* EVERY BUFFER HERE IS FED BY A REMOTE STRANGER'S DEVICE. The output block bounds
       decoded bytes, but once records are consumed the accumulate cap (sink->max) never
       sees them, so INPUT needs its own bound or a stream of records decoding to nothing
       keeps this sink receiving for ever. Output tracks input to +0.09% measured, so
       input a megabyte past the output ceiling is not a photo. */
    if (p->in_total > p->out_cap + (1u << 20)) {
      p->fail = RXF_CAP;
      AD_LOG("RX-CAP: %lu B in vs %lu B out ceiling -- input bound tripped\n",
             (unsigned long)p->in_total, (unsigned long)p->out_cap);
    }
  }
  if (p->mode == RXM_STREAM && !p->fail) {
    int end = AD_DVZIP_END_RUNNING;
    uint32_t consumed = ad_dvzip_drain(sk->buf, sk->len, false, rx_pump_emit, p, &end);
    if (consumed) {
      memmove(sk->buf, sk->buf + consumed, sk->len - consumed);
      sk->len -= consumed;
    }
  }
  if (p->fail) {
    /* Stop the receive at the next chunk header rather than draining megabytes we can
       no longer store: max=0 turns any further chunk into HTTP_RECV_OVERFLOW, and
       rx_upload translates the reason into a status BEFORE the response -- which is
       the entire point of decoding in flight. */
    sk->max = 0;
    if (p->fail == RXF_OOM || (p->fail == RXF_CAP && p->psram_limited))
      g_rx_grow_failed = true;                          /* -> 507, not 413 */
  }
  p->residue_prev = sk->len;
}

static bool rx_sink_grow(struct HttpSink *sk, uint32_t need) {
  uint32_t nc = sk->cap ? sk->cap : (512u * 1024);
  while (nc < need) nc <<= 1;
  uint8_t *np = (uint8_t *)heap_caps_realloc(sk->buf, nc, MALLOC_CAP_SPIRAM);
  if (!np) {
    /* SAY WHICH FAILURE THIS IS. A failed grow returns false, http_recv_chunked turns that
       into HTTP_RECV_OVERFLOW, and the caller reports "file too large" -- which names a
       policy limit when what actually happened is that PSRAM ran out. The two want
       opposite responses from a user, and they used to be indistinguishable in the log.
       This changes no behaviour; it only stops the log from misdiagnosing. */
    g_rx_grow_failed = true;
    AD_LOG("RX-OOM: grow %lu -> %lu B failed (need %lu), %lu free / %lu largest in PSRAM\n",
           (unsigned long)sk->cap, (unsigned long)nc, (unsigned long)need,
           (unsigned long)heap_caps_get_free_size(MALLOC_CAP_SPIRAM),
           (unsigned long)heap_caps_get_largest_free_block(MALLOC_CAP_SPIRAM));
    return false;
  }
  sk->buf = np; sk->cap = nc; return true;
}

// Receive the /Upload body, decoding a DvZip stream WHILE it arrives, so the
// outcome is known BEFORE the response is written -- receive+decode, judge, answer.
// Called on the TLS task, reading through the connection's persistent reader `r`.
// Sets g_upload_ok / g_img_* on success, g_img_err on failure.
static void rx_upload(struct HttpRdr *r, bool chunked, int clen) {
  mbedtls_ssl_context *ssl = (mbedtls_ssl_context *)r->ctx;
  g_rx_active = true; g_rx_bytes = 0;
  g_rx_touch_ms = (uint32_t)(esp_timer_get_time() / 1000);
  g_rx_grow_failed = false;
  uint32_t err0 = g_img_err;

