s-iwaki-d/ESP32Drop/ESP32Drop/src/airdrop/port/ad_port_esp32.cpp
  struct RxPump pump;
  memset(&pump, 0, sizeof(pump));
  pump.end = AD_DVZIP_END_RUNNING;   /* zero is END_RECORD, which claims certainty */
#ifdef AIRDROP_BODY_KEEP
  pump.mode = RXM_RAW;               /* the probe build keeps the RAW body: decoding
                                        in flight would destroy the evidence it exists
                                        to capture */
#endif

  /* The receive buffer. Under streaming it holds only the RESIDUE -- one held-back
     record plus one arriving one, worst legit case 131,122 + ~131,126 B at the
     measured grain -- so 320 KiB never has to grow. A RAW body (gzip, bare cpio)
     accumulates whole and grows on demand exactly as before. */
  uint32_t cap = 320u * 1024, len = 0;
  uint32_t body_total = 0;
  uint8_t *gz = (uint8_t *)heap_caps_malloc(cap, MALLOC_CAP_SPIRAM);
  bool overflow = false, clean_end = false;
  if (!gz) { strlcpy(g_img_errmsg, "out of PSRAM", sizeof(g_img_errmsg)); g_img_err++; goto done_norsp; }

  // The de-chunker, the DvZip completion probe and the poisoning rules all live in
  // ad_http.h, compiled unchanged into tools/test-http.sh. There is exactly one
  // implementation: a second copy here is how a latent bug survived being flashed
  // (the settle branch used to append a chunk without re-judging completeness, so a
  // DvZip end record arriving right after a boundary probe was consumed and ignored;
  // the host tests found it).
  if (chunked) {
    struct HttpSink sk;
    memset(&sk, 0, sizeof(sk));
    sk.buf = gz; sk.cap = cap; sk.len = 0; sk.max = g_rx_max; sk.grow = rx_sink_grow;
    sk.progress = rx_sink_progress;
    sk.ctx = &pump;                    /* the progress hook decodes through this */
    // 10s while the body is flowing; 3000ms of silence to accept a boundary-aligned
    // DvZip stream. 3000ms because measured stalls on this link are 3004ms and
    // 4104ms and a shorter settle would answer 200 OK on a truncated body whose
    // DvZip prefix still decompresses -- a corrupt image reported as a success.
    int rc = http_recv_chunked(r, &sk, 10000, 3000, http_set_timeout);
    gz = sk.buf; cap = sk.cap; len = sk.len;   /* len: whole body (RAW) or residue (STREAM) */
    body_total = (pump.mode == RXM_STREAM) ? pump.in_total : len;
    g_rx_bytes = body_total;
    switch (rc) {
      case HTTP_RECV_OK_END_RECORD: clean_end = true;
        AD_LOG("UPLOAD: complete via DvZip end record\n"); break;
      case HTTP_RECV_OK_LAST_CHUNK: clean_end = true;
        AD_LOG("UPLOAD: complete via HTTP last-chunk\n"); break;
      case HTTP_RECV_OK_SILENCE:    clean_end = true;
        AD_LOG("UPLOAD: complete via boundary + 3s silence\n"); break;
      case HTTP_RECV_OVERFLOW:      overflow = true; break;
      default:
        /* The reason was thrown away here, which is why two identical 2,352,506-byte
           failures could not be told apart. rc IS the reason. */
        AD_LOG("UPLOAD-STOP: rc=%d after %lu bytes\n", rc, (unsigned long)body_total);
        break;
    }
    EV("upload_recv rc=%d total=%lu residue=%lu decoded=%lu poisoned=%d eof=%d",
       rc, (unsigned long)body_total, (unsigned long)len,
       (unsigned long)pump.out_len, r->poisoned, r->eof);
  } else if (clen > 0) {
    if ((uint32_t)clen > g_rx_max) overflow = true;
    else {
      if ((uint32_t)clen > cap) {
        uint8_t *np = (uint8_t *)heap_caps_realloc(gz, clen, MALLOC_CAP_SPIRAM);
        if (np) { gz = np; cap = clen; } else overflow = true;
      }
      if (!overflow) { len = hr_read(r, gz, clen); body_total = len; g_rx_bytes = len; clean_end = (len == (uint32_t)clen); }
    }
  }

  /* STREAMED BODIES FINISH DECODING HERE, BEFORE THE RESPONSE. The residue is at
     most one held-back record (plus the end record's four bytes), so this is one
     tinfl call against the ~1s window sharingd allows a response -- not the
     whole-body decode that used to sit, unreportable, after the 200. */
  if (pump.mode == RXM_STREAM && !pump.fail && len) {
    int dend = AD_DVZIP_END_RUNNING;
    (void)ad_dvzip_drain(gz, len, true, rx_pump_emit, &pump, &dend);
    pump.end = dend;
  }
  /* A pump failure IS a receipt failure: fold it into the same ladder. (The 507/413
     split repeats here because the final drain runs outside the progress hook.) */
  if (pump.fail == RXF_OOM || pump.fail == RXF_CAP) {
    overflow = true;
    if (pump.fail == RXF_OOM || pump.psram_limited) g_rx_grow_failed = true;
  }

  {  /* TELL THE SENDER WHETHER WE ACTUALLY GOT IT.
      *
      * This used to answer 200 unconditionally, on the rule that "success is about
      * receipt, not decode". The rule is right and the code did not implement it: an
      * overflow IS a receipt failure, and we were reporting it as receipt success. The
      * consequence was visible: the badge said the transfer had failed while the Mac sat on
      * "Sending" indefinitely, because the only thing we ever told it was 200.
      *
      * Decoding in flight moves the rest of the outcomes to this side of the response,
      * and each names itself. 507 and 413 are different facts -- one is this device
      * being out of memory right now, the other is a file this device can never take --
      * and a user can act on the difference. A record whose zlib will not inflate is
      * 400: with TLS below us those bytes are the bytes the sender produced, and a 200
      * for an archive we provably cannot reconstruct is the exact lie this redesign
      * exists to remove. Only failures discovered after this write -- the cpio walk,
      * the sketch's handler -- still answer 200, because receipt truly did succeed. */
    const char *status = "200 OK";
    /* INFLATE is judged first: aborting a receive mid-body (the sink's max=0 clamp)
       surfaces as OVERFLOW too, and the record that would not inflate is the truer
       fact than the abort it caused. */
    if (pump.fail == RXF_INFLATE)          status = "400 Bad Request";
    else if (overflow)                     status = g_rx_grow_failed ? "507 Insufficient Storage"
                                                                     : "413 Content Too Large";
    else if (body_total < 6)               status = "400 Bad Request";
    char h[128];
    int hl = snprintf(h, sizeof(h),
                      "HTTP/1.1 %s\r\nContent-Length: 0\r\nConnection: close\r\n\r\n", status);
    ssl_write_all(ssl, (const unsigned char *)h, hl);
    if (status[0] != '2') {
      /* DO NOT CLOSE ON TOP OF THE STATUS WE JUST WROTE.
       *
       * Writing a non-2xx and returning immediately closes the connection with megabytes
       * of body still unread, and in lwIP a close with unread data is tcp_abort -- a RST.
       * A RST discards our OWN unsent send queue, and on a link with a 6.25% duty cycle
       * the status is still sitting in that queue waiting for a 65 ms window. So the
       * failure report we just composed would be destroyed by the close that follows it,
       * and the sender would see the same silence as before. This tree already knows the
       * mechanism: it is written out at ad_serve.h as RFC 2525 2.17, and it is why the
       * /Ask drain exists.
       *
       * BEST-EFFORT, and honestly so. Bounded at 3 s, which is enough to carry the status
       * out through two windows and to avoid the immediate RST. It is NOT enough to
       * guarantee the sender reads it: today's /Ask measurement showed sharingd posts its
       * receive only once its whole send is queued, so with more than its 131,072-byte
       * send buffer still unsent it may never look. Draining that much could take minutes
       * at the 27 KB/s this link gives, which is not a trade worth making blind.
       * UPLOAD-REPLY-DRAIN is logged so a field observation can settle whether the Mac
       * actually shows the failure; until it does, this is a fix for one known destroyer
       * of the message, not a proof the message arrives. */
      unsigned char scrap[512]; uint32_t t0 = (uint32_t)(esp_timer_get_time() / 1000);
      uint32_t binned = 0; uint32_t now;
      http_set_timeout(r, 300);
      while (!r->eof && ((now = (uint32_t)(esp_timer_get_time() / 1000)) - t0) < 3000) {
        int g = hr_read(r, scrap, sizeof(scrap));
        if (g > 0) binned += (uint32_t)g;
      }
      AD_LOG("UPLOAD-REPLY: %s; drained %lu B in %lu ms before closing\n", status,
             (unsigned long)binned,
             (unsigned long)((uint32_t)(esp_timer_get_time() / 1000) - t0));
    }
  }
  AD_LOG("UPLOAD: received %lu bytes (chunk=%d ovf=%d complete=%d)\n",
                (unsigned long)body_total, chunked, overflow, clean_end);
  if (pump.fail == RXF_INFLATE) {          /* before overflow, same order as the status */
    snprintf(g_img_errmsg, sizeof(g_img_errmsg), "record %lu would not inflate",
             (unsigned long)(pump.nrec + 1));
    g_img_err++; goto done;
  }
  if (overflow) {
    strlcpy(g_img_errmsg, g_rx_grow_failed ? "out of PSRAM" : "file too large",
            sizeof(g_img_errmsg));
    g_img_err++; goto done;
  }
  if (body_total < 6) { strlcpy(g_img_errmsg, "empty body", sizeof(g_img_errmsg)); g_img_err++; goto done; }

  if (pump.mode != RXM_STREAM) {
    // dump the body head so the format is unambiguous next run (1f8b=gzip, 070707=odc
    // cpio, else=unknown/DvZip). Streamed bodies consumed their head long ago; their
    // shape is already on the RX-STREAM line.
    char hx[3 * 32 + 1] = {0}; int hn = (len < 32) ? (int)len : 32;
    for (int i = 0; i < hn; i++) sprintf(hx + i * 3, "%02x ", gz[i]);
    AD_LOG("UPLOAD: body head (%lu bytes): %s\n", (unsigned long)len, hx);
  }

#ifdef AIRDROP_BODY_KEEP
  /* THE PROBE BUILD KEEPS THE BODY INSTEAD OF PARSING IT.
   *
   * Every question we have asked about this stream so far -- is the top bit of a record
   * length a flag, is the payload stored or deflated, does the record grain stay 128 KiB --
   * has cost one physical AirDrop of a 2.4 MB photo and about 71 s of a person's time, and has
   * answered exactly one hypothesis. That trade is bad and it does not have to be made:
   * the bytes themselves answer every hypothesis, including the ones nobody has thought of
   * yet, and they answer them offline, for ever.
   *
   * So this build does not inflate. It hands the raw body to the sketch, which writes it
   * out and lets tools/decode-body.py reconstruct it to a file. One AirDrop, then the
   * question moves to a host test where it belongs.
   *
   * Skipping the inflate is not laziness -- it is what makes the peak safe. Parsing would
   * hold the 2.35 MB body and a 2.65 MB output buffer at once; this holds only the body. */
  if (!g_body_ready) {
    g_body_len = len; g_body_block = gz; gz = nullptr;
    g_body_ready = true;                                       // release flag: set LAST
    AD_LOG("BODY-KEEP: %lu bytes held for dump\n", (unsigned long)g_body_len);
  } else {
    AD_LOG("BODY-KEEP: previous body not yet dumped, discarding %lu bytes\n",
           (unsigned long)len);
  }
  goto done;
#endif

  {
    const uint8_t *cpio = nullptr; uint32_t cpio_len = 0; uint8_t *outbuf = nullptr;
    if (pump.mode == RXM_STREAM) {
      // Decoded already, during receipt -- the outcome the response above was built
      // from. All that is left is to give back the slack: the output block was
      // allocated at the ceiling, and a shrinking realloc to the real size frees the
      // tail in place.
      heap_caps_free(gz); gz = nullptr;                      // the residue served its purpose
      if (pump.out_len) {
        uint8_t *shr = (uint8_t *)heap_caps_realloc(pump.out, pump.out_len, MALLOC_CAP_SPIRAM);
        if (shr) pump.out = shr;
      }
      outbuf = pump.out; pump.out = nullptr;                 // ownership moves to the handoff
      cpio = outbuf; cpio_len = pump.out_len;
      AD_LOG("DVZIP: %lu records (%lu stored), %lu in -> %lu out, end=%s\n",
             (unsigned long)pump.nrec, (unsigned long)pump.nstored,
             (unsigned long)body_total, (unsigned long)cpio_len,
             ad_dvzip_end_name(pump.end));
      /* A WALK THAT STOPPED IS NOT A WALK THAT FINISHED. The whole files inside a
         short archive are still real files, so they are still delivered -- but the
         archive is not called complete. */
      if (!ad_dvzip_end_ok(pump.end)) {
        snprintf(g_img_errmsg, sizeof(g_img_errmsg), "dvzip %s at %lu of %lu",
                 ad_dvzip_end_name(pump.end), (unsigned long)cpio_len,
                 (unsigned long)body_total);
        g_img_err++;
      }
    } else if (gz[0] == 0x1f && gz[1] == 0x8b && gz[2] == 0x08) {   // gzip -> gunzip
      uint32_t off = 10; uint8_t flg = gz[3];
      if (flg & 0x04) { if (off + 2 <= len) { off += 2 + (gz[off] | (gz[off + 1] << 8)); } }  // FEXTRA
      if (flg & 0x08) { while (off < len && gz[off]) off++; off++; }                          // FNAME
      if (flg & 0x10) { while (off < len && gz[off]) off++; off++; }                          // FCOMMENT
      if (flg & 0x02) { off += 2; }                                                           // FHCRC
      uint32_t isize = (len >= 4) ? (gz[len - 4] | (gz[len - 3] << 8) |
                                     (gz[len - 2] << 16) | ((uint32_t)gz[len - 1] << 24)) : 0;
      if (off + 8 > len || isize == 0 || isize > g_rx_max) {
        strlcpy(g_img_errmsg, "bad gzip", sizeof(g_img_errmsg)); g_img_err++; goto done;
      }
      outbuf = (uint8_t *)heap_caps_malloc(isize, MALLOC_CAP_SPIRAM);
      if (!outbuf) { strlcpy(g_img_errmsg, "out of PSRAM", sizeof(g_img_errmsg)); g_img_err++; goto done; }
      size_t out = tinfl_decompress_mem_to_mem(outbuf, isize, gz + off, len - off, 0);
      if (out == TINFL_DECOMPRESS_MEM_TO_MEM_FAILED) {
        heap_caps_free(outbuf);
        strlcpy(g_img_errmsg, "inflate failed", sizeof(g_img_errmsg)); g_img_err++; goto done;
      }
      cpio = outbuf; cpio_len = out;
      heap_caps_free(gz); gz = nullptr;                        // free compressed ASAP
    } else if (memcmp(gz, "07070", 5) == 0) {                  // already-raw cpio (odc/newc)
      cpio = gz; cpio_len = len;
    } else {
      // A DvZip body that was NOT streamed: the probe build (BODY_KEEP forces RAW), a
      // non-chunked body (the progress hook never ran), or a first record the streaming
      // signature declined. Decoded here, once, through the SAME pump -- one decoder,
      // whichever moment it runs at. This is the one decode still on the wrong side of
      // the response; every shape a current macOS/iOS sender actually produces takes
      // the streamed path above.
      bool dvzip = ad_dvzip_looks_like(gz, len);
      /* GIVE THE SLACK BACK FIRST. The receive buffer grows by DOUBLING, so the body
         may sit in a block nearly twice its size while the pump below is about to ask
         for the output ceiling out of an 8 MiB part. Shrinking to the actual length
         costs one realloc that almost always stays in place. */
      { uint8_t *shr = (uint8_t *)heap_caps_realloc(gz, len ? len : 1, MALLOC_CAP_SPIRAM);
        if (shr) gz = shr; }
      if (dvzip && rx_pump_open(&pump)) {
        int dvend = AD_DVZIP_END_RUNNING;
        (void)ad_dvzip_drain(gz, len, true, rx_pump_emit, &pump, &dvend);
        pump.end = dvend;
        heap_caps_free(gz); gz = nullptr;
        if (pump.fail) {
          heap_caps_free(pump.out); pump.out = nullptr;
          strlcpy(g_img_errmsg, pump.fail == RXF_INFLATE ? "dvzip inflate failed"
                              : pump.fail == RXF_OOM     ? "out of PSRAM"
                                                         : "file too large",
                  sizeof(g_img_errmsg));
          g_img_err++; goto done;
        }
        if (pump.out_len) {
          uint8_t *shr2 = (uint8_t *)heap_caps_realloc(pump.out, pump.out_len, MALLOC_CAP_SPIRAM);
          if (shr2) pump.out = shr2;
        }
        outbuf = pump.out; pump.out = nullptr;
        cpio = outbuf; cpio_len = pump.out_len;
        AD_LOG("DVZIP: %lu records (%lu stored), %lu in -> %lu out, end=%s (post-hoc)\n",
               (unsigned long)pump.nrec, (unsigned long)pump.nstored, (unsigned long)len,
               (unsigned long)cpio_len, ad_dvzip_end_name(pump.end));
        /* A WALK THAT STOPPED IS NOT A WALK THAT FINISHED.
           This used to return the buffer and say nothing: 1,310,889 bytes of a ~2,354,000
           byte archive reached the caller labelled good, and the only reason anyone found
           out was that a cpio walker two layers away happened to notice. The whole files
           inside a short archive are still real files, so they are still delivered -- but
           the archive is not called complete. */
        if (!ad_dvzip_end_ok(pump.end)) {
          snprintf(g_img_errmsg, sizeof(g_img_errmsg), "dvzip %s at %lu of %lu",
                   ad_dvzip_end_name(pump.end), (unsigned long)cpio_len, (unsigned long)len);
          g_img_err++;
        }
      } else {
        strlcpy(g_img_errmsg, dvzip ? "out of PSRAM" : "not a cpio/gzip", sizeof(g_img_errmsg));
        g_img_err++; goto done;
      }
    }

    { // dump the reconstructed cpio head so we can see the format/first entry
      char hx[3 * 48 + 1] = {0}; int hn = (cpio_len < 48) ? (int)cpio_len : 48;
      for (int i = 0; i < hn; i++) sprintf(hx + i * 3, "%02x ", cpio[i]);
      AD_LOG("CPIO: %lu bytes head: %s\n", (unsigned long)cpio_len, hx);
    }
    if (g_arch_ready) {
      // A previous archive is still waiting to be handed over. Dropping the new one is
      // right -- the alternative is freeing a block the consumer may be inside.
      if (outbuf) heap_caps_free(outbuf); else if (gz) { heap_caps_free(gz); gz = nullptr; }
      g_img_err++;
      strlcpy(g_img_errmsg, "previous not collected", sizeof(g_img_errmsg));
    } else {
      g_arch_block = outbuf ? outbuf : gz;
      gz = nullptr; outbuf = nullptr;                          // ownership transferred
      g_arch_buf = cpio; g_arch_len = cpio_len;
      g_upload_ok++;
      g_arch_ready = true;                                     // release flag: set LAST
      AD_LOG("UPLOAD-OK! %lu bytes of cpio -> handler\n", (unsigned long)cpio_len);
    }
  }

done:
  if (gz) heap_caps_free(gz);
  if (pump.out) heap_caps_free(pump.out);   // a decode block that never reached handoff
  if (g_img_err != err0) AD_LOG("UPLOAD-ERR: %s\n", g_img_errmsg);   // was silent before
  g_rx_active = false;
  return;
done_norsp:
  g_rx_active = false;
}

// HTTP phase: runs AFTER the TLS handshake completes, on the committed connection
// (fd set blocking + recv_timeout bio by the caller). Serves /Discover -> tile,
// /Ask -> accept, /Upload -> receive. sharingd reuses ONE TLS connection for the
// /Ask -> /Upload pair, so we loop over requests until it closes. A single
// persistent buffered reader spans the whole connection: request bodies (incl.
// the chunked /Ask metadata) are drained through it, so the next request starts
// exactly where the last one ended -- no bytes are read-ahead and lost.
static void sv_upload(struct HttpServe *s, bool chunked, int clen) {
  rx_upload(s->r, chunked, clen);
}
/* Zero-timeout look at the listening socket: is the upload connection already sitting in
   the backlog? It is how the /Ask drain knows the sender has read our 200 -- see the note
   at the drain in ad_serve.h. */
static int g_listen_fd = -1;
static bool sv_peer_waiting(struct HttpServe *) {
  if (g_listen_fd < 0) return false;
  fd_set rf; FD_ZERO(&rf); FD_SET(g_listen_fd, &rf);
  struct timeval tv = {0, 0};
  return select(g_listen_fd + 1, &rf, nullptr, nullptr, &tv) > 0 && FD_ISSET(g_listen_fd, &rf);
}

static void sv_on_ask_sent(struct HttpServe *) {
  g_rx_active = true; g_rx_bytes = 0;   // switch the badge to the "Receiving" screen
  g_rx_touch_ms = (uint32_t)(esp_timer_get_time() / 1000);
}

