s-iwaki-d/ESP32Drop/ESP32Drop/src/airdrop/port/ad_port_esp32.cpp
static void serve_http(mbedtls_ssl_context *ssl) {
  struct HttpRdr r; http_rdr_init(&r, ssl, http_src_mbedtls);
  struct HttpServe sv; memset(&sv, 0, sizeof(sv));
  sv.r = &r; sv.io = ssl;
  sv.write = sv_write; sv.now = sv_now; sv.log = sv_log;
  sv.set_timeout = http_set_timeout;
  sv.disc_body = g_disc_body; sv.disc_len = (int)g_disc_len;
  sv.ask_body  = g_ask_body;  sv.ask_len  = (int)g_ask_len;
  sv.disc_ms = &g_disc_ms; sv.ask_ms = &g_ask_ms;
  sv.disc_ok = &g_discover_ok; sv.ask_ok = &g_ask_ok; sv.desync = &g_desync;
  sv.on_ask_sent = sv_on_ask_sent; sv.upload = sv_upload;
  sv.peer_waiting = sv_peer_waiting;
  sv.enter_ms = g_http_enter_ms;
  serve_http_run(&sv);
}

// TLS acceptor as a single-task, single-session, non-blocking select() loop that
// "follows the ClientHello". sharingd opens ~4 PARALLEL connections (racing) and
// sends its real ClientHello on the one it commits to; a blocking one-at-a-time
// server was always stuck waiting on a dead connection while the live CH rotted
// unread. Here every fd is O_NONBLOCK; we select() over all of them, adopt the
// NEWEST fd that has a queued ClientHello (MSG_PEEK), step the handshake without
// blocking, and preempt a silent active connection if a newer one gets a CH.
// ClientHello witness: wrap the handshake-phase recv BIO and hexdump the first
// CH_DUMP_MAX bytes of each adopted connection's inbound stream ("CH <ms> off=N <hex>").
// This is the discriminating measurement for the cycle-start resumption misses: the
// CH is plaintext, so its session_id + extensions (supported_versions 0x2b, key_share
// 0x33, session_ticket 0x23, ALPN 0x10) settle at once (a) whether the unknown IDs
// are TLS1.3-compat random fill, (b) whether enabling server tickets could even
// negotiate, (c) whether ALPN/False Start is on the table, (d) whether the client
// offers TLS1.3 at all. Dumping the byte STREAM (not per-segment) reassembles a CH
// split across segments for free. The inbound segment ceiling is ~1220 B [D] -- the
// 1280-byte AWDL path MTU less 40 bytes of IPv6 and 20 of TCP header; nothing on this
// path records an actual inbound segment length, so that figure is arithmetic, not a
// measurement. 1600B may truncate an oversized CH -- the offline parser sees the
// record length and flags it; bump the cap and re-measure if that happens.
// Runs in tcp_listen_task (not process_frame),
// so the "no Serial in process_frame" invariant is untouched; worst case is one
// ~4.8KB burst per adoption, which only fires on real sharingd connections.
#ifdef AIRDROP_CH_DUMP
#define CH_DUMP_MAX 1600
static int g_chdump_left = 0;   // bytes still to dump for the current adoption
static int g_chdump_off  = 0;   // cumulative stream offset, for offline reassembly
static int chdump_recv(void *ctx, unsigned char *buf, size_t len) {
  int r = mbedtls_net_recv(ctx, buf, len);
  if (r > 0 && g_chdump_left > 0) {
    int n = (r < g_chdump_left) ? r : g_chdump_left;
    for (int off = 0; off < n; off += 32) {
      char line[160]; int m = (n - off < 32) ? (n - off) : 32;
      int p = snprintf(line, sizeof(line), "CH %lu off=%d ",
                       (unsigned long)millis(), g_chdump_off + off);
      for (int i = 0; i < m && p < (int)sizeof(line) - 3; i++)
        p += snprintf(line + p, sizeof(line) - p, "%02x", buf[off + i]);
      line[p++] = '\n';
      ad_diag_stage(line, p);
    }
    g_chdump_off  += n;
    g_chdump_left -= n;
    if (g_chdump_left == 0) EV("chdump end off=%d more=%d", g_chdump_off, r - n);
  }
  return r;
}
#endif  /* AIRDROP_CH_DUMP */

#define MAXC 12
/* THE LISTENER'S ACTUAL STACK NEED. SETTLED: 32,768 allocated, 17,348 used at the peak.
 *
 * The task is created with 32,768 bytes. It was raised there from 4,096 because the mbedTLS
 * handshake overflowed the smaller stack and crashed, which establishes 4,096 is too little. What is enough is the measurement above: a real
 * transfer peaks at 17,348 bytes used, so 32,768 carries roughly 15 KB of headroom. The
 * number is worth having because the reserve is expensive -- 32,768 CONTIGUOUS bytes of
 * internal RAM is the largest single allocation the library makes, out of the same heap
 * mbedTLS wants two ~16.6 KB blocks from, so a sketch that fails to start the listener is
 * short of contiguous internal heap rather than of stack.
 *
 * Because the answer is known, the SAMPLING is behind AD_DIAG_DETAIL. It was the first
 * statement of the select loop's for(;;), so it ran ~10 times a second for the life of the
 * device to re-derive a constant. With the define off nothing writes g_ls_stack_min and
 * ad_listen_stack_min_free() reports 0, which is exactly what it reports before the task
 * has run; re-open the question by rebuilding with -DAD_DIAG_DETAIL.
 *
 * It is the minimum over the task's life, not the instant value: a handshake's peak is what
 * matters and it is over in a second. uxTaskGetStackHighWaterMark returns BYTES on
 * ESP-IDF, not words, whatever the AWDL layer's function name suggests. */
static volatile uint32_t g_ls_stack_min = 0xffffffffu;

uint32_t ad_listen_stack_min_free(void) {
  return (g_ls_stack_min == 0xffffffffu) ? 0 : g_ls_stack_min;
}

static void tcp_listen_task(void *) {
  airdrop_tls_init();
  int ls = -1;
  int conn[MAXC]; uint32_t born[MAXC];
  for (int i = 0; i < MAXC; i++) conn[i] = -1;
  int active = -1; uint32_t t_data = 0, t_hs0 = 0;
  for (;;) {
#ifdef AD_DIAG_DETAIL
    { uint32_t hw = (uint32_t)uxTaskGetStackHighWaterMark(nullptr);
      if (hw < g_ls_stack_min) g_ls_stack_min = hw; }
#endif
    if (!g_tls_ready) { vTaskDelay(pdMS_TO_TICKS(1000)); airdrop_tls_init(); continue; }
    if (ls < 0) {
      ls = socket(AF_INET6, SOCK_STREAM, 0);
      if (ls < 0) { vTaskDelay(pdMS_TO_TICKS(500)); continue; }
      int one = 1; setsockopt(ls, SOL_SOCKET, SO_REUSEADDR, &one, sizeof(one));
      struct sockaddr_in6 a; memset(&a, 0, sizeof(a));
      a.sin6_family = AF_INET6; a.sin6_port = htons(AIRDROP_PORT);   // in6addr_any
      if (bind(ls, (struct sockaddr *)&a, sizeof(a)) != 0 || listen(ls, 8) != 0) {
        close(ls); ls = -1; g_listen_fd = -1; vTaskDelay(pdMS_TO_TICKS(1000)); continue;
      }
      set_nonblock(ls, true);
      g_listen_fd = ls;            // published for sv_peer_waiting(), which ends the /Ask drain
      AD_LOG("[tcp] TLS listening (select loop) on [::]:%d\n", AIRDROP_PORT);
    }

    fd_set rf; FD_ZERO(&rf); FD_SET(ls, &rf); int mx = ls;
    for (int i = 0; i < MAXC; i++) if (conn[i] >= 0) { FD_SET(conn[i], &rf); if (conn[i] > mx) mx = conn[i]; }
    struct timeval tv = { 0, 100000 };            // 100ms tick
    select(mx + 1, &rf, NULL, NULL, &tv);
    uint32_t now = millis();

