s-iwaki-d/ESP32Drop/ESP32Drop/src/airdrop/port/ad_port_esp32.cpp
    // 1. Drain the accept backlog (non-blocking); TCP_NODELAY + O_NONBLOCK each.
    // The count here is diagnostic gold: while the task is inside serve_http it does
    // not call accept() at all, so connections sharingd opened during that window
    // sit in lwIP's listen backlog and all appear at once on the next pass. A
    // non-zero `since_http` on this line means we were deaf when the sender knocked.
    int n_acc_this_pass = 0;
    for (;;) {
      struct sockaddr_in6 c; socklen_t cl = sizeof(c);
      int fd = accept(ls, (struct sockaddr *)&c, &cl);
      if (fd < 0) break;
      int one = 1; setsockopt(fd, IPPROTO_TCP, TCP_NODELAY, &one, sizeof(one));
      set_nonblock(fd, true);
      g_tcp_accept++;
      n_acc_this_pass++;
      EV("accept fd=%d port=%u since_http=%lu", fd, ntohs(c.sin6_port),
         (unsigned long)(g_http_exit_ms ? (now - g_http_exit_ms) : 0));
      int slot = -1;
      for (int i = 0; i < MAXC; i++) if (conn[i] < 0) { slot = i; break; }
      if (slot < 0) {                              // full: evict oldest non-active
        int old = -1; uint32_t oldest = 0xffffffff;
        for (int i = 0; i < MAXC; i++) if (i != active && born[i] < oldest) { oldest = born[i]; old = i; }
        if (old >= 0) { close(conn[old]); conn[old] = -1; slot = old; }
      }
      if (slot >= 0) { conn[slot] = fd; born[slot] = now; } else { EV("drop fd=%d table_full", fd); close(fd); }
    }
    if (n_acc_this_pass > 1)
      EV("backlog n=%d since_http=%lu -- sender knocked while we were deaf",
         n_acc_this_pass, (unsigned long)(g_http_exit_ms ? (now - g_http_exit_ms) : 0));

    // 2. Among fds select() marked READABLE, reap the EOF/error ones and pick the
    //    NEWEST that has a ClientHello queued. (Only peek readable fds -- an idle
    //    fd with no data yet must NOT be touched/closed; relying on errno==EAGAIN
    //    to tell "no data" from "closed" was closing idle connections before their
    //    ClientHello arrived, so the loop never adopted anything.)
    int cand = -1; uint32_t cand_born = 0;
    for (int i = 0; i < MAXC; i++) {
      if (conn[i] < 0 || i == active) continue;
      if (!FD_ISSET(conn[i], &rf)) continue;      // not readable -> still waiting for CH
      unsigned char b; int r = recv(conn[i], &b, 1, MSG_PEEK);
      if (r <= 0) { close(conn[i]); conn[i] = -1; continue; }   // EOF/error -> reap
      if (cand < 0 || born[i] > cand_born) { cand = i; cand_born = born[i]; }
    }

    // 3. Elect (no active) or preempt (active silent >1.2s AND a newer CH waits).
    bool adopt = false;
    if (active < 0 && cand >= 0) adopt = true;
    else if (active >= 0 && cand >= 0 && cand != active &&
             born[cand] > born[active] && (uint32_t)(now - t_data) > 1200) {
      AD_LOG("[serve] preempt fd=%d -> fd=%d\n", conn[active], conn[cand]);
      close(conn[active]); conn[active] = -1; active = -1; adopt = true;
    }
    /* The select loop's own heartbeat: how many fds are held, how many are readable, and
       which one the election above picked. It is gated only by a 1000 ms timer, so it fires
       whether or not any connection exists, and it spends one of the ring's eight slots
       every second -- against lines like `adopt`, `cull` and `hs_fail`, which arrive in
       bursts and are the reason anyone reads the ring at all. Nothing in the tree parses
       "[loop]"; it is for a human watching an election go wrong, so it is behind
       AD_DIAG_DETAIL and off unless someone is watching. */
#ifdef AD_DIAG_DETAIL
    { static uint32_t t_dbg = 0; if ((uint32_t)(now - t_dbg) >= 1000) { t_dbg = now;
        int nc = 0, rd = 0;
        for (int i = 0; i < MAXC; i++) if (conn[i] >= 0) { nc++; if (FD_ISSET(conn[i], &rf)) rd++; }
        AD_LOG("[loop] nconn=%d rdbl=%d cand=%d active=%d acc=%lu\n",
                      nc, rd, cand, active, (unsigned long)g_tcp_accept); } }
#endif
    if (adopt) {
      mbedtls_ssl_session_reset(&g_ssl);
      g_net.fd = conn[cand];
#ifdef HTTP_TRACE
      ht_arm();                                        // arm the decrypted-stream witness
#endif
#ifdef AIRDROP_CH_DUMP
      g_chdump_left = CH_DUMP_MAX; g_chdump_off = 0;   // arm the CH witness
      mbedtls_ssl_set_bio(&g_ssl, &g_net, mbedtls_net_send, chdump_recv, NULL);
#else
      mbedtls_ssl_set_bio(&g_ssl, &g_net, mbedtls_net_send, mbedtls_net_recv, NULL);
#endif
      active = cand; t_hs0 = t_data = now;
      EV("adopt fd=%d age=%lu heap=%u", conn[cand], (unsigned long)(now - born[cand]),
         (unsigned)esp_get_free_internal_heap_size());
    }

    // 4. Step the handshake on the active connection (non-blocking).
    if (active >= 0 && conn[active] >= 0) {
      if (FD_ISSET(conn[active], &rf)) t_data = now;
      int r = mbedtls_ssl_handshake(&g_ssl);
      if (r == 0) {
        g_tls_ok++;
        EV("tlsok fd=%d %s hs_ms=%lu heap=%u", conn[active], mbedtls_ssl_get_version(&g_ssl),
           (unsigned long)(now - t_hs0), (unsigned)esp_get_free_internal_heap_size());
        int afd = conn[active];
        int killed = 0;
        for (int i = 0; i < MAXC; i++) if (conn[i] >= 0 && i != active) { close(conn[i]); conn[i] = -1; killed++; }
        if (killed) EV("cull n=%d -- closed sharingd's other parallel connections", killed);
        set_nonblock(afd, false);                  // HTTP phase: blocking + read timeout
        mbedtls_ssl_set_bio(&g_ssl, &g_net, mbedtls_net_send, mbedtls_net_recv, mbedtls_net_recv_timeout);
        g_http_enter_ms = millis();
        EV("http_enter fd=%d", afd);
        serve_http(&g_ssl);
        g_http_exit_ms = millis();
        EV("http_exit fd=%d blocked_ms=%lu since_disc=%lu", afd,
           (unsigned long)(g_http_exit_ms - g_http_enter_ms),
           (unsigned long)(g_disc_ms ? (g_http_exit_ms - g_disc_ms) : 0));
        mbedtls_ssl_close_notify(&g_ssl);
        close(afd); conn[active] = -1; active = -1;
        mbedtls_ssl_session_reset(&g_ssl);
      } else if (r != MBEDTLS_ERR_SSL_WANT_READ && r != MBEDTLS_ERR_SSL_WANT_WRITE) {
        EV("hs_fail fd=%d err=-0x%04x", conn[active], -r);
        close(conn[active]); conn[active] = -1; active = -1;
        mbedtls_ssl_session_reset(&g_ssl);
      }
    } else active = -1;

    // 5. Handshake deadline: drop a connection that never finishes.
    if (active >= 0 && (uint32_t)(now - t_hs0) > 15000) {
      AD_LOG("[tls] handshake deadline (fd=%d)\n", conn[active]);
      close(conn[active]); conn[active] = -1; active = -1;
      mbedtls_ssl_session_reset(&g_ssl);
    }
  }
}

