s-iwaki-d/ESP32Drop/ESP32Drop/src/airdrop/port/ad_port_esp32.cpp
/* ==========================================================================
 * The seam. Everything above this line moved unchanged; everything below it is
 * new, and it is new because twenty file-scope globals used to cross here.
 * ========================================================================== */

/* --- the received file ---------------------------------------------------- */

static ad_file_cb_t g_file_cb  = nullptr;
static void        *g_file_ctx = nullptr;

void ad_on_file(ad_file_cb_t cb, void *ctx) { g_file_cb = cb; g_file_ctx = ctx; }

/* The consumer half. The TLS task published a whole cpio archive and did no parsing; this
 * walks it and hands over every regular file, on the CALLER's task.
 *
 * The producer ordering in rx_upload -- block, then buf/len, then g_arch_ready LAST -- is
 * the release flag this relies on, and it is unchanged.
 *
 * ONE CALLBACK PER FILE, and the type is never a filter. What this replaces returned the
 * first JPEG or PNG in the archive and threw the rest away: a PDF, a text file, a contact
 * card, or the second of two photos disappeared, and the transfer was reported as "no
 * displayable image" rather than as delivered. The archives in the capture corpus are all
 * two entries -- a zero-byte "." directory and the file -- which is why the directory is
 * skipped by MODE rather than by guessing at names or at zero length.
 *
 * The PSRAM block is freed once, after the last file, which is why AdFile::data is
 * documented as callback-lifetime only. */
void ad_poll(void) {
  if (!g_arch_ready) return;

  const uint8_t *buf = g_arch_buf;
  uint32_t blen = g_arch_len;

  /* Count first, so a handler can say "file 2 of 3" without the library having to promise
     an ordering it does not control. Two passes over an in-RAM buffer costs microseconds. */
  uint32_t total = 0;
  { struct AdCpioIter it; struct AdCpioEntry e;
    ad_cpio_begin(&it, buf, blen);
    while (ad_cpio_next(&it, &e)) if (ad_cpio_is_regular(e.mode)) total++; }

  uint32_t idx = 0;
  bool any_refused = false;
  { struct AdCpioIter it; struct AdCpioEntry e;
    ad_cpio_begin(&it, buf, blen);
    while (ad_cpio_next(&it, &e)) {
      if (!ad_cpio_is_regular(e.mode)) continue;      /* the "." every transfer carries */
      /* The archive's name is not NUL-terminated in a way we should trust, so it is copied
         into a bounded buffer rather than handed over as a pointer into remote bytes. */
      char path[128], name[64];
      uint32_t pl = e.name_len < sizeof(path) - 1 ? e.name_len : sizeof(path) - 1;
      memcpy(path, e.name, pl); path[pl] = 0;
      uint32_t bl; const char *b = ad_cpio_basename(e.name, e.name_len, &bl);
      if (bl > sizeof(name) - 1) bl = sizeof(name) - 1;
      memcpy(name, b, bl); name[bl] = 0;

      struct AdFile f;
      f.data = e.data; f.len = e.len; f.name = name; f.path = path;
      f.type = ad_cpio_sniff(e.data, e.len);
      f.index = idx++; f.count = total;

      bool ok = g_file_cb ? g_file_cb(g_file_ctx, &f) : false;
      if (ok) g_files_ok++;
      else { g_img_err++; any_refused = true; }
    }
    if (it.truncated) {
      g_img_err++;
      strlcpy(g_img_errmsg, "archive truncated", sizeof(g_img_errmsg));
      AD_LOG("CPIO-CUT: stopped at %lu of %lu after %lu regular files\n",
             (unsigned long)it.pos, (unsigned long)blen, (unsigned long)total);
    } else if (total == 0) {
      g_img_err++;
      strlcpy(g_img_errmsg, "archive held no files", sizeof(g_img_errmsg));
    } else if (any_refused) {
      strlcpy(g_img_errmsg, "handler refused a file", sizeof(g_img_errmsg));
    } }

  if (g_arch_block) { heap_caps_free(g_arch_block); g_arch_block = nullptr; }
  g_arch_buf = nullptr; g_arch_len = 0;
  g_arch_ready = false; g_rx_active = false;
}

/* --- lifecycle ------------------------------------------------------------ */

static bool g_ad_role_receiver = false;
bool ad_role_is_receiver(void) { return g_ad_role_receiver; }

int ad_begin(const char *name, uint32_t max_receive) {
  /* The roles are exclusive: a receiver holds a 32 KB listener stack and a sender holds a
     TLS client context for its whole life, and neither leaves room for the other beside
     AWDL. Recording which one claimed the device lets the second attempt be refused
     instead of half-working in a way nothing reports. */
  g_ad_role_receiver = true;

  /* 0 means the library's own default, RX_MAX_AUTO (6 MiB); PSRAM can only lower what is
     actually granted, and AdStatus.rx_max reports it. A tiny value is honoured as given -- refusing to accept
     anything is a legitimate thing for a sketch to want, and second-guessing it would just
     hide the setting. What PSRAM cannot supply is reported through AdStatus.rx_max, not
     silently substituted. */
  g_rx_max = max_receive ? max_receive : RX_MAX_AUTO;
  awdl_ring_init(&g_adlog.cur, AD_DIAG_SLOTS);   /* before the task that fills it */

  /* The name is what a sender sees. Refusing a bad one here, before anything is
     advertised, beats advertising something the user did not ask for: a name that cannot
     be encoded is a mistake worth reporting, not worth papering over. */
  if (!name || !*name) name = "ESP32";
  strlcpy(g_name, name, sizeof(g_name));
  if (!ad_build_identity(g_name)) return -2;

  /* AWDL must already be up: the identity below is derived from the interface MAC, and
     the mDNS records we are about to advertise are built out of it. */
  awdl_identity(&g_id);
  awdl_rx_tap_set(ad_rx_tap, nullptr);
  /* No announce callback is registered -- there is no periodic multicast announcement, for
     the reasons set out in the note above ad_respond(). The hook itself stays available. */
  /* 32 KB: mbedTLS handshake state is on this stack, and CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC
   * means it cannot be moved to PSRAM. Priority 2 round-robins with the AWDL cadence. */
  return xTaskCreatePinnedToCore(tcp_listen_task, "tcp_listen", 32768, nullptr, 2,
                                 nullptr, 1) == pdPASS ? 0 : -1;
}

/* --- telemetry ------------------------------------------------------------ */

void ad_stats_read(struct AdStatus *out) {
  out->tcp_accept  = g_tcp_accept;
  out->tls_ok      = g_tls_ok;
  out->discover_ok = g_discover_ok;
  out->ask_ok      = g_ask_ok;
  out->upload_ok   = g_upload_ok;
  out->desync      = g_desync;
  /* Recency, for the same reason AwdlStatus needed it: a state with no clock behind it
     cannot notice that it stopped being true. */
  { uint32_t now_ms = (uint32_t)(esp_timer_get_time() / 1000);
    out->rx_active = g_rx_active && (uint32_t)(now_ms - g_rx_touch_ms) <= AD_RX_STALL_MS; }
  out->rx_bytes    = g_rx_bytes;
  out->rx_max      = g_rx_max_eff;
  out->files_ok    = g_files_ok;
  out->file_err    = g_img_err;
  strlcpy(out->file_errmsg, g_img_errmsg, sizeof(out->file_errmsg));
  out->tls_alg     = g_tls_alg;
  out->ec_crt_err  = g_ec_crt_err;
  out->ec_key_err  = g_ec_key_err;
  out->query_seen  = g_query_seen;
  out->resp_tx     = g_resp_tx;
  out->notus       = g_notus;
  out->ka_suppress = g_ka_suppress;
  out->dump_count  = g_dump_count;
  out->tcp_tous    = g_tcp_tous;
  out->syn_airdrop = g_syn_airdrop;
  out->syn_pair1   = g_syn_pair1;
  out->syn_pair2   = g_syn_pair2;
  out->syn_other   = g_syn_other;
  out->syn_other_port = g_syn_other_port;
}

#else  /* ESP32DROP_SENDER */

/* A sender build. The receiving implementation is not here -- see the note at the top of
   this file. Nothing is stubbed out: ad_begin(), ad_poll() and the rest simply do not
   exist, so calling one is a link error rather than a silent waste of 32 KB.
   ad_role_is_receiver() is the single exception, because ad_sender_begin() asks it. */
#include "ad_port_esp32.h"
bool ad_role_is_receiver(void) { return false; }

#endif /* !ESP32DROP_SENDER */
